#pragma once

#include "global.h"
#include "anime.h"
#include "efxbattle.h"

struct ProcEfxMagicOBJ {
    PROC_HEADER;

    STRUCT_PAD(0x29, 0x2C);
    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;
    STRUCT_PAD(0x30, 0x5C);
    /* 5C */ struct Anim * anim;
    /* 60 */ struct Anim * anim2;
    /* 64 */ ProcPtr seproc;
};

struct ProcEfxEclipseBG
{
    PROC_HEADER;

    /* 29 */ u8 unk29;
    STRUCT_PAD(0x2A, 0x2C);
    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;
    /* 30 */ s16 unk30;
    STRUCT_PAD(0x32, 0x44);
    /* 44 */ u32 frame;
    /* 48 */ const u16 * frame_config;
    /* 4C */ u16 ** tsal;
    /* 50 */ u16 ** tsar;
    /* 54 */ u16 ** img;
    /* 58 */ u16 * pal;
    /* 5C */ struct Anim * anim;
};

typedef void (*SpellAnimFunc)(struct Anim * anim);
extern CONST_DATA SpellAnimFunc gEkrSpellAnimLut[];

extern u32 FramScr_Unk5D4F90[];
extern CONST_DATA struct ProcCmd ProcScr_efxRestRST[];
extern CONST_DATA struct ProcCmd ProcScr_efxTwobaiRST[];
extern CONST_DATA struct ProcCmd ProcScr_DummvRST[];
extern CONST_DATA struct ProcCmd ProcScr_EfxRestWIN[];
extern CONST_DATA struct ProcCmd ProcScr_EfxRestWINH[];

ProcPtr NewefxRestRST(struct Anim * anim, int unk44, int unk48, int frame, int unk50);
void sub_805B444(struct ProcEfx * proc);
void efxRestRSTMain(struct ProcEfx * proc);
void NewEfxTwobaiRST(struct Anim * anim, int a);
void EfxTwobaiRSTMain(struct ProcEfx * proc);
void NewDummvRST(struct Anim * anim, int unk44);
void sub_805B584(void);
void DummvRSTMain(struct ProcEfx * proc);
void NewEfxRestWIN(struct Anim * anim, int unk44, void * unk54, void * unk58);
void EfxRestWINMain(struct ProcEfx * proc);
// ??? EfxMagicHBlank_805B724(???);
