#pragma once

#include "global.h"
#include "proc.h"
#include "anime.h"
#include "bmitem.h"

enum ekr_battle_unit_position {
    EKR_POS_L,
    EKR_POS_R
};

int GetAnimPosition(struct Anim * anim);

enum ekr_hit_identifer {
    EKR_HITTED = 0,
    EKR_MISS
};

int CheckRoundMiss(s16);

struct ProcEkrBattleDeamon {
    PROC_HEADER;

    /* 29 */
};

struct ProcEkrBattle {
    PROC_HEADER;

    /* 29 */ u8 speedup;
    /* 2A */ u8 _pad_2A[0x2C - 0x2A];
    /* 2C */ s16 timer;
    /* 2E */ s16 end;
    /* 30 */ u8 _pad_30[0x44 - 0x30];
    /* 44 */ int side;
    /* 48 */ int counter;
    /* 4C */ u8 _pad_4C[0x54 - 0x4C];
    /* 54 */ int is_quote;
    /* 58 */ int unk58;
    /* 5C */ struct Anim * anim;
};

struct ProcEkrLvupFan {
    PROC_HEADER;

    /* 29 */ u8 _pad_29[0x2C - 0x29];
    /* 2C */ s16 timer;
};

struct EkrGaugeStruct1 {
    u8 _pad_00[0x3C - 0x0];
    void *unk3C;
};

struct ProcEkrGauge {
    PROC_HEADER;

    /* 29 */ u8 battle_init;           /* 1 in battle-starting and 0 after battle started */
    /* 2A */ u8 valid;
    /* 2B */ u8 _pad_2B[0x32 - 0x2B];
    /* 32 */ s16 unk32;
    /* 34 */ u8 _pad_34[0x3A - 0x34];
    /* 3A */ s16 unk3A;
    /* 3C */ u8 _pad_3C[0x44 - 0x3C];
    /* 44 */ int unk44;
    /* 48 */ int unk48;
    /* 4C */ int unk4C;
    /* 50 */ int unk50;
    /* 54 */
};

enum gEkrDistanceType_index {
    EKR_DISTANCE_CLOSE,
    EKR_DISTANCE_FAR,
    EKR_DISTANCE_FARFAR,
    EKR_DISTANCE_MONOCOMBAT,
    EKR_DISTANCE_PROMOTION
};
extern s16 gEkrDistanceType;

struct ProcEfxSpdQuake {
    PROC_HEADER;

    /* 29 */ STRUCT_PAD(0x29, 0x2C);
    /* 2C */ s16 timer;
    /* 2E */ STRUCT_PAD(0x2E, 0x44);
    /* 44 */ struct Vec2 *vecs;
    /* 48 */ STRUCT_PAD(0x48, 0x5C);
    /* 5C */ struct Anim * anim;
};

void NewEfxspdquake(struct Anim * anim);
void sub_8055A64(struct ProcEfxSpdQuake * proc);
void sub_8055B38(struct ProcEfxSpdQuake * proc);

struct ProcEkrBattleStarting {
    PROC_HEADER;

    /* 29 */ STRUCT_PAD(0x29, 0x2C);

    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;

    /* 30 */ STRUCT_PAD(0x30, 0x32);

    /* 32 */ s16 x1;
    /* 34 */ s16 x2;

    /* 36 */ STRUCT_PAD(0x36, 0x3A);

    /* 3A */ s16 y1;
    /* 3C */ s16 y2;
};

void NewEkrBattleStarting(void);
void ekrBaStart_InitScreen(struct ProcEkrBattleStarting * proc);
void ekrBaStart_SreenFailIn(struct ProcEkrBattleStarting * proc);
void ekrBaStart_InitBattleScreen(struct ProcEkrBattleStarting * proc);
void ekrBaStart_ExecEkrBattle6C(struct ProcEkrBattleStarting * proc);
void ekrBaStart_8055FE8(struct ProcEkrBattleStarting * proc);
void ekrBaStart_8056024(struct ProcEkrBattleStarting * proc);
void ekrBaStart_8056078(struct ProcEkrBattleStarting * proc);

struct ProcEkrBattleEnding {
    PROC_HEADER;

    /* 29 */ STRUCT_PAD(0x29, 0x2C);

    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;

    /* 30 */ STRUCT_PAD(0x30, 0x32);

    /* 32 */ s16 x1;
    /* 34 */ s16 x2;

    /* 36 */ STRUCT_PAD(0x36, 0x3A);

    /* 3A */ s16 y1;
    /* 3C */ s16 y2;
};

void NewEkrbattleending(void);
void ekrBattleEnding_80560F0(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_8056170(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_80561C8(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_8056228(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_8056288(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_8056310(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_8056390(struct ProcEkrBattleEnding * proc);
void ekrBattleEnding_8056484(struct ProcEkrBattleEnding * proc);

struct ProcEkrBaseKaiten {
    PROC_HEADER;

    /* 29 */ u8 unk29;
    /* 2A */ u16 unk2A;
    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;
    /* 30 */ u16 unk30;

    /* 32 */ s16 x1;
    /* 34 */ s16 x2;
    /* 36 */ s16 unk36;

    /* 38 */ STRUCT_PAD(0x38, 0x3A);

    /* 3A */ s16 y1;
    /* 3C */ s16 y2;
    /* 3E */ s16 unk3E;

    /* 40 */ STRUCT_PAD(0x40, 0x44);

    /* 44 */ int type;

    /* 48 */ STRUCT_PAD(0x48, 0x5C);

    /* 5C */ struct Anim * anim;
    /* 60 */ const u16 * unk60;
};

void NewEkrBaseKaiten(int identifier);
void EkrBaseKaitenMain(struct ProcEkrBaseKaiten * proc);

struct ProcUnitKakudai {
    PROC_HEADER;

    /* 29 */ STRUCT_PAD(0x29, 0x2C);

    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;
    /* 30 */ u16 unk30;

    /* 32 */ s16 x1;
    /* 34 */ s16 x2;
    /* 36 */ s16 left_pos;
    /* 38 */ s16 right_pos;
    /* 3A */ s16 y1;
    /* 3C */ s16 y2;

    /* 3E */ STRUCT_PAD(0x3E, 0x44);

    /* 44 */ int type;

    /* 48 */ STRUCT_PAD(0x48, 0x4C);

    /* 4C */ u32 valid_l;
    /* 50 */ u32 valid_r;
    /* 54 */ void * pOaml;
    /* 58 */ void * pOamr;
};

void NewEkrUnitKakudai(int identifier);
void UnitKakudaiPrepareAnimScript(struct ProcUnitKakudai * proc);
void UnitKakudaiMain(struct ProcUnitKakudai * proc);
void UnitKakudaiEndNop(struct ProcUnitKakudai * proc);

struct ProcEkrIntroWindow {
    PROC_HEADER;

    /* 29 */ STRUCT_PAD(0x29, 0x2C);

    /* 2C */ s16 timer;
    /* 2E */ s16 terminator;
    /* 30 */ s16 ymax;

    /* 32 */ STRUCT_PAD(0x32, 0x44);

    /* 44 */ int type;
    /* 48 */ int ymax_name;
};

void NewEkrWindowAppear(int identifier, int);
bool CheckEkrWindowAppearUnexist(void);
void EkrWindowAppearMain(struct ProcEkrIntroWindow * proc);
void NewEkrNamewinAppear(int identifier, int duration, int delay);
bool CheckEkrNamewinAppearUnexist(void);
void EkrNamewinAppearDelay(struct ProcEkrIntroWindow * proc);
void EkrNamewinAppearMain(struct ProcEkrIntroWindow * proc);
void NewEkrBaseAppear(int identifier, int duration);
bool CheckEkrBaseAppearUnexist(void);
void EkrBaseAppearMain(struct ProcEkrIntroWindow * proc);

extern struct ProcCmd ProcScr_ekrWindowAppear[];
extern struct ProcCmd ProcScr_ekrNamewinAppear[];
extern struct ProcCmd ProcScr_ekrBaseAppear[];

extern int gEkrWindowAppearExist;
extern int gEkrNamewinAppearExist;
extern int gProcEkrBaseAppearExist;

struct ProcEkrChienCHR {
    PROC_HEADER;

    /* 29 */ STRUCT_PAD(0x29, 0x5C);

    /* 5C */ struct Anim * anim;
};

enum AnimRoundData_type_identifier {
    ANIM_ROUND_HIT_CLOSE,
    ANIM_ROUND_CRIT_CLOSE,
    ANIM_ROUND_NONCRIT_FAR,
    ANIM_ROUND_CRIT_FAR,
    ANIM_ROUND_TAKING_MISS_CLOSE,
    ANIM_ROUND_TAKING_MISS_FAR,
    ANIM_ROUND_TAKING_HIT_CLOSE,
    ANIM_ROUND_STANDING,
    ANIM_ROUND_TAKING_HIT_FAR,
    ANIM_ROUND_MISS_CLOSE,
    ANIM_ROUND_MAX,

    ANIM_ROUND_INVALID = -1,
};

enum anim_round_type {
    ANIM_ROUND_BIT8 = 0x0100,
    ANIM_ROUND_PIERCE = 0x0200,
    ANIM_ROUND_GREAT_SHIELD = 0x0400,
    ANIM_ROUND_SURE_SHOT = 0x0800,
    ANIM_ROUND_SILENCER = 0x1000,
    ANIM_ROUND_POISON = 0x2000,
    ANIM_ROUND_BIT14 = 0x4000,
    ANIM_ROUND_DEVIL = 0x8000,    
};

extern s16 gAnimRoundData[];
s16 GetBattleAnimRoundType(int index);
s16 GetBattleAnimRoundTypeFlags(int);

#define GetRoundFlagByAnim(aAnim) (GetBattleAnimRoundTypeFlags((aAnim->nextRoundId - 1) * 2 + GetAnimPosition(aAnim)))

extern u8 gEfxHpLut[];

enum banim_mode_index {
    BANIM_MODE_NORMAL_ATK,
    BANIM_MODE_NORMAL_ATK_PRIORITY_L,
    BANIM_MODE_CRIT_ATK,
    BANIM_MODE_CRIT_ATK_PRIORITY_L,
    BANIM_MODE_RANGED_ATK,
    BANIM_MODE_RANGED_CRIT_ATK,
    BANIM_MODE_CLOSE_DODGE,
    BANIM_MODE_RANGED_DODGE,
    BANIM_MODE_STANDING,
    BANIM_MODE_STANDING2,
    BANIM_MODE_RANGED_STANDING,
    BANIM_MODE_MISSED_ATK,

    BANIM_MODE_INVALID = -1,
};

struct BanimRoundScript {
    u8 frame_front;
    u8 priority_front;
    u8 frame_back;
    u8 priority_back;
};

#define SPECIAL_BANIM_WTYPE (0x100 | ITYPE_ITEM)

struct BattleAnimDef {
    u16 wtype;
    u16 index;
};

// extern const struct BanimRoundScript BanimDefaultModeConfig[ANIM_ROUND_MAX * 4];
extern const u8 BanimDefaultModeConfig[ANIM_ROUND_MAX * 4];

struct ProcEkrSubAnimeEmulator {
    PROC_HEADER;

    /* 29 */ u8 type;
    /* 2A */ u8 valid;
    /* 2C */ s16 timer;
    /* 2E */ s16 scr_cur;

    STRUCT_PAD(0x30, 0x32);

    /* 32 */ s16 x1;
    /* 34 */ s16 x2;

    STRUCT_PAD(0x36, 0x3A);

    /* 3A */ s16 y1;
    /* 3C */ s16 y2;

    STRUCT_PAD(0x3E, 0x44);

    /* 44 */ u32 * anim_scr;
    /* 48 */ void * sprite;
    /* 4C */ int oam2Base;
    /* 50 */ int oamBase;
};

struct ProcEkrSubAnimeEmulator * NewEkrsubAnimeEmulator(int x, int y, u32 * anim_scr, int type, int oam2Base, int oamBase, ProcPtr parent);
void EkrsubAnimeEmulatorMain(struct ProcEkrSubAnimeEmulator * proc);

struct ProcEfxSoundSE {
    PROC_HEADER;

    STRUCT_PAD(0x29, 0x2C);

    /* 2C */ s16 timer;

    STRUCT_PAD(0x2E, 0x44);

    /* 44 */ int volume;
    /* 48 */ int index;
};

void EfxPlaySE(int songid, int volume);
void Loop6C_efxSoundSE(struct ProcEfxSoundSE * proc);
void DoM4aSongNumStop(int);
// ??? EfxOverrideBgm(???);
// ??? StopBGM1(???);
void UnregisterEfxSoundSeExist(void);
void RegisterEfxSoundSeExist(void);
int CheckEfxSoundSeExist(void);
void M4aPlayWithPostionCtrl(int, int, int);
void EfxPlaySEwithCmdCtrl(struct Anim * anim, int);

extern int gEkrDebugTimer, gEkrDebugUnk1;

extern u16 gEkrPairBanimID[2];
extern s16 gBattleInitSide[2];

extern struct BattleUnit *gpEkrBattleUnitLeft;
extern struct BattleUnit *gpEkrBattleUnitRight;
extern struct Font gSomeFontStruct;

extern struct Anim *gAnims[4];
extern void *gUnknown_02000010[2];
extern int gEkrDebugUnk2;
extern int gEkrDebugUnk3;
extern s16 gEkrXPosReal[2];
extern s16 gEkrYPosReal[2];
extern u16 gEkrXPosBase[];
extern u16 gEkrYPosBase[];
extern struct Vec2 gEkrBg0QuakeVec;
extern void *gUnknown_0200003C[2];
extern void *gUnknown_02000044[2];
