#pragma once

#include "global.h"
#include "proc.h"
#include "event.h"

struct UnkProc80855A0 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4D - 0x29];
    /* 4D */ u8 unk4D;
};

struct Proc8085618 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s8 unk4C;
};

struct Proc89EE068 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x54 - 0x29];
    /* 54 */ ProcPtr unk_proc;
};

struct ProcWorldFlush {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x2C - 0x29];
    /* 2C */ u32 count;
};

struct ProcEventMapAnim {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s16 timer;
    /* 4E */ u8 _pad_4E[0x52 - 0x4E];
    /* 52 */ u16 count;
    /* 54 */ u8 _pad_54[0x64 - 0x54];
    /* 64 */ s16 mode;
};

struct Proc89EEA28 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s16 timer;
    /* 4E */ u8 _pad_4E[0x52 - 0x4E];
    /* 52 */ u16 count;
    /* 54 */ u8 _pad_54[0x64 - 0x54];
    /* 64 */ s16 mode;
};

void EventCallGameOverExt(ProcPtr proc);
void GameOver_FadeOutCurrentBgm(ProcPtr proc);
void SkilGameOverForToturialExtraMap(ProcPtr proc);
void PostGameOverHandler(ProcPtr proc);
int CheckWaitAction_unused(void);
void UnsetKeyIgnoreMask(void);
void AsnycKeyStatus_ButtonB(void);
void NewForceAsyncButtonB(ProcPtr proc);
void HideAllAlliesExceptLeader(void);
void ResetAllPlayerUnitState(void);
// ??? TryLockParentProc(???);
// ??? TryUnlockParentProc(???);
// ??? ResetAllBG(???);
// ??? SwapUnitStatsChar100(???);
// ??? sub_8085550(???);
// ??? sub_8085578(???);
// ??? sub_80855A0(???);
// ??? sub_80855D4(???);
// ??? sub_80855F8(???);
void sub_8085618(struct Proc * proc);
void sub_8085670(struct Proc * proc);
// ??? sub_80856D0(???);
// ??? sub_8085728(???);
// ??? sub_808576C(???);
// ??? sub_80857B0(???);
// ??? sub_80857F4(???);
// ??? sub_808581C(???);
// ??? sub_8085844(???);
// ??? sub_808586C(???);
void sub_8085894(struct Proc * proc);
void sub_808589C(struct Proc * proc);
// ??? sub_808591C(???);
// ??? sub_8085948(???);
void SetEventId_0x84(ProcPtr);
void UnsetEventId_0x84(ProcPtr);
void sub_8085988(struct EventEngineProc * proc);
void sub_8085990(struct EventEngineProc * proc);
void sub_80859D0(ProcPtr proc, ProcPtr parent);
void nullsub_20(ProcPtr);
void WorldFlushInit(struct ProcWorldFlush * proc);
void WorldFlushOut(struct ProcWorldFlush * proc);
void WorldFlushReload(struct ProcWorldFlush * proc);
void WorldFlushIn(struct ProcWorldFlush * proc);
// ??? WorldFlushCallBack(???);
void StartWorldFlush(struct EventEngineProc * proc);
// ??? sub_8085C10(???);
// ??? sub_8085C24(???);
// ??? sub_8085C38(???);
// ??? sub_8085C4C(???);
// ??? sub_8085C58(???);
void DisplayMapClearMapAnim(ProcPtr proc);
void DisplayCongratulationsMapAnim(ProcPtr proc);
void DisplayEventMapAnim(ProcPtr, int);
void DrawEventMapAnimMaskfx(int, int);
// ??? sub_8085E08(???);
// ??? sub_8085E48(???);
// ??? sub_8085E94(???);
// ??? nullsub_30(???);
// ??? sub_8085F88(???);
// ??? sub_808609C(???);
// ??? sub_8086100(???);
// ??? sub_8086134(???);
// ??? sub_808613C(???);
// ??? sub_808622C(???);
// ??? sub_80862C4(???);
// ??? sub_808635C(???);
// ??? HandleCh5xUnits_Start(???);
// ??? HandleCh5xUnits_End(???);
// ??? CallRouteSplitMenu(???);
// ??? MenuCommand_DrawRouteSplit(???);
// ??? Command_EirikaMode(???);
// ??? Command_EphraimMode(???);
void AutolevelSecondaryLord();

extern CONST_DATA EventListScr EventScr_CallOnTutorialMode[];
extern CONST_DATA EventListScr EventScr_CallOnHardMode[];
extern CONST_DATA EventListScr EventScr_CallOnChapterNumber[];
extern CONST_DATA EventListScr EventScr_CallIfCommonMode[];
extern CONST_DATA EventListScr EventScr_CallWithModeCheck[];
extern CONST_DATA EventListScr EventScr_SetFlagIfPlayedThrough[];
extern CONST_DATA EventListScr Event_TextWithBG[];
extern CONST_DATA EventListScr EventScr_UnTriggerIfNotUnit[];
extern CONST_DATA EventListScr EventScr_UnTriggerIfNotFaction[];
extern CONST_DATA EventListScr EventScr_EndAndResetTriggEvent[];
extern CONST_DATA EventListScr EventScr_LoadUnitWithRestrictionCtrl[];
extern CONST_DATA EventListScr EventScr_LoadUnitForDifferentMode[];
extern CONST_DATA EventListScr EventScr_LoadUnitForTutorial[];
extern CONST_DATA EventListScr EventScr_LoadReinforce[];
extern CONST_DATA EventListScr EventScr_LoadReinforceHardMode[];
extern CONST_DATA EventListScr EventScr_TextShowWithFadeIn[];
extern CONST_DATA EventListScr EventScr_SetBackground[];
extern CONST_DATA EventListScr Event_TextWithBG[];
extern CONST_DATA EventListScr EventScr_ApplyActiveUnitTileChange[];
extern CONST_DATA EventListScr EventScr_ApplyTileChangeForFactionIfAlly[];
extern CONST_DATA EventListScr EventScr_ApplyTileChangeForFactionIfEnemy[];
extern CONST_DATA EventListScr EventScr_ApplyTileChangeForFactionIfNPC[];
extern CONST_DATA EventListScr EventScr_ApplyTileChangeForFaction[];
extern CONST_DATA EventListScr EventScr_FormatFlashingCursor[];
extern CONST_DATA EventListScr EventScr_MoveUnitS2ToLeader[];
extern CONST_DATA EventListScr EventScr_FormatMoveUnit[];
extern CONST_DATA EventListScr EventScr_LoadUniqueAlly[];
extern CONST_DATA EventListScr EventScr_UnitWarpIN[];
extern CONST_DATA EventListScr EventScr_UnitWarpOUT[];
extern CONST_DATA EventListScr EventScr_UnitFlushingIN[];
extern CONST_DATA EventListScr EventScr_UnitFlushingOUT[];
extern CONST_DATA EventListScr EventScr_9EE5BC[];
extern CONST_DATA EventListScr EventScr_GiveTreasureToLuckyDog[];
extern CONST_DATA EventListScr EventScr_ChangeAIinQueue[];
extern CONST_DATA EventListScr EventScr_9EE6A0[];
extern CONST_DATA EventListScr EventScr_9EE6C8[];
extern CONST_DATA EventListScr EventScr_Tutorial_Exec0[];
extern CONST_DATA EventListScr EventScr_Tutorial_Exec1[];
extern CONST_DATA EventListScr EventScr_ConfigHardModeLoadUnitHard[];
extern CONST_DATA EventListScr EventScr_9EE84C[];
extern CONST_DATA EventListScr EventScr_9EE8F0[];
extern CONST_DATA EventListScr EventScr_FloorClearInTower[];
extern CONST_DATA EventListScr EventScr_WholeTowerClear[];

extern CONST_DATA EventListScr EventScr_Prologue_BeginingScene[];
extern CONST_DATA EventListScr EventScr_Prologue_RenaisThroneCutscene[];
extern CONST_DATA EventListScr EventScr_Prologue_GiveRapier[];
extern CONST_DATA EventListScr EventScr_Prologue_ONeillSpawn[];
extern CONST_DATA EventListScr EventScr_Prologue_OneEmimyLeft[];
extern CONST_DATA EventListScr EventScr_Prologue_ONeillAttack[];
extern CONST_DATA EventListScr EventScr_Prologue_EndingScene[];
extern CONST_DATA EventListScr EventScr_Prologue_EirikaAttacked[];
extern CONST_DATA EventListScr EventScr_Prologue_Turn1[];
extern CONST_DATA EventListScr EventScr_Prologue_Turn2[];
extern CONST_DATA EventListScr EventScr_Prologue_Turn3[];
extern CONST_DATA EventListScr EventScr_Prologue_ExecTut[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial0[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial1[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial2[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial3[];
extern CONST_DATA EventListScr EventScr_Prologue_TutMessageTurn1[];
extern CONST_DATA EventListScr EventScr_Prologue_TutMessageTurn2[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial4[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial5[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial6[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial7[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial8[];
extern CONST_DATA EventListScr EventScr_Prologue_Tutorial9[];
extern CONST_DATA EventListScr EventScr_Prologue_OneillSethBattle[];
extern CONST_DATA EventListScr EventScr_Prologue_TutEirikaAttack[];
extern CONST_DATA EventListScr EventScr_Prologue_TutorialA[];
extern CONST_DATA EventListScr EventScr_Prologue_TutorialB[];
extern CONST_DATA EventListScr EventScr_Prologue_TutorialC[];
extern CONST_DATA EventListScr EventScr_Prologue_TutorialD[];
extern CONST_DATA EventListScr EventScr_Prologue_TutorialE[];
extern CONST_DATA EventListScr EventScr_Prologue_9EF828[];
extern CONST_DATA EventListScr EventScr_Ch1_BeginingScene[];
extern CONST_DATA EventListScr EventScr_Ch1_Turn1Player[];
extern CONST_DATA EventListScr EventScr_Ch1_Turn1Enemy[];
extern CONST_DATA EventListScr EventScr_Ch1_Turn_AllyReinforceArrive[];
extern CONST_DATA EventListScr EventScr_Ch1_Misc_DefeatBoss[];
extern CONST_DATA EventListScr EventScr_Ch1_EndingScene[];
extern CONST_DATA EventListScr EventScr_Ch1_Talk_SethFranz[];
extern CONST_DATA EventListScr EventScr_Ch1_Talk_EirikaFranz[];
extern CONST_DATA EventListScr EventScr_Ch1_Loca_Visit1[];
extern CONST_DATA EventListScr EventScr_Ch1_Loca_Visit2[];
extern CONST_DATA EventListScr EventScr_Ch1_Misc_Area[];
extern CONST_DATA EventListScr EventScr_Ch1_Turn_EnemyReinforceArrive[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_GuideWTA[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_EirikaVisitHouseIdle1[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_EirikaVisitHouseIdle2[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_EirikaVisitHouseEnd[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_GuideTerrainHeal[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_OnBeginning[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_GuideMsg944[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_GilliamBattle[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_TradeSelectGalliamIdle1[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_TradeSelectGalliamIdle2[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_TradeSelectGalliamEnd[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_AfterTrade[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_PostTradeAndItemUseAction[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_GuideMsgSeize[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_ChooseSethTurn1[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_SethMoveToEnemy[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_BeforeSethMoveToEnemy[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_AfterSethMoveToEnemy[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_GuideOnBKSEL[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_AfterSethBattleEirikaVisit[];
extern CONST_DATA EventListScr EventScr_Ch1Tut_MsgOnGuideOption[];

extern struct UnitDefinition UnitDef_Event_PrologueAlly[];
extern struct UnitDefinition UnitDef_Event_PrologueEnemy[];
extern struct UnitDefinition UnitDef_Event_PrologueThroneRoomUnits[];
extern struct UnitDefinition UnitDef_Event_PrologueMessager[];
extern struct UnitDefinition UnitDef_Event_PrologueGradoRoyals[];
extern struct UnitDefinition UnitDef_Event_PrologueGradoShamans[];
extern struct UnitDefinition UnitDef_Event_PrologueGradoCavalry[];
extern struct UnitDefinition UnitDef_Event_PrologueEscapees[];
extern struct UnitDefinition UnitDef_Event_PrologueValterGroup[];
extern struct UnitDefinition UnitDef_Event_Ch1Ally[];
extern struct UnitDefinition UnitDef_Event_Ch1Enemy[];
extern struct UnitDefinition UnitDef_Event_Ch1AllyReinforce[];
extern struct UnitDefinition UnitDef_Event_Ch1EnemyReinforce[];
extern struct UnitDefinition UnitDef_Event_Ch1NPC[];
