#pragma once

#include "global.h"
#include "proc.h"
#include "event.h"
#include "uimenu.h"

struct UnkProc80855A0 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4D - 0x29];
    /* 4D */ u8 unk4D;
};

struct Proc8085618 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s8 unk4C;
};

struct Proc89EE068 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x54 - 0x29];
    /* 54 */ ProcPtr unk_proc;
};

struct ProcWorldFlush {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x2C - 0x29];
    /* 2C */ u32 count;
};

struct ProcEventMapAnim {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s16 timer;
    /* 4E */ u8 _pad_4E[0x52 - 0x4E];
    /* 52 */ u16 count;
    /* 54 */ u8 _pad_54[0x64 - 0x54];
    /* 64 */ s16 mode;
};

struct Proc89EEA28 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s16 timer;
    /* 4E */ u8 _pad_4E[0x52 - 0x4E];
    /* 52 */ u16 count;
    /* 54 */ u8 _pad_54[0x64 - 0x54];
    /* 64 */ s16 mode;
};

struct Unknown03000600 {
    u8 pid;
    s8 x;
    s8 y;

    u8 _pad_;
};

void EventCallGameOverExt(ProcPtr proc);
void GameOver_FadeOutCurrentBgm(ProcPtr proc);
void SkilGameOverForToturialExtraMap(ProcPtr proc);
void PostGameOverHandler(ProcPtr proc);
int CheckWaitAction_unused(void);
void UnsetKeyIgnoreMask(void);
void AsnycKeyStatus_ButtonB(void);
void NewForceAsyncButtonB(ProcPtr proc);
void HideAllAlliesExceptLeader(void);
void ResetAllPlayerUnitState(void);
// ??? TryLockParentProc(???);
// ??? TryUnlockParentProc(???);
// ??? ResetAllBG(???);
// ??? SwapUnitStatsChar100(???);
// ??? sub_8085550(???);
// ??? sub_8085578(???);
// ??? sub_80855A0(???);
// ??? sub_80855D4(???);
// ??? sub_80855F8(???);
void sub_8085618(struct Proc * proc);
void sub_8085670(struct Proc * proc);
// ??? sub_80856D0(???);
// ??? sub_8085728(???);
// ??? sub_808576C(???);
// ??? sub_80857B0(???);
// ??? sub_80857F4(???);
// ??? sub_808581C(???);
// ??? sub_8085844(???);
