#include "global.h"

#include <string.h>

#include "constants/classes.h"

#include "proc.h"
#include "hardware.h"
#include "fontgrp.h"
#include "uiutils.h"
#include "chapterdata.h"
#include "rng.h"
#include "ctc.h"
#include "bmunit.h"
#include "bmmap.h"
#include "bmbattle.h"
#include "bmtrick.h"
#include "mu.h"
#include "uimenu.h"
#include "bmtrap.h"
#include "gamecontrol.h"
#include "bmarena.h"
#include "bmudisp.h"
#include "bm.h"
#include "bmsave.h"
#include "bmlib.h"
#include "worldmap.h"
#include "bmio.h"
#include "bmmind.h"

// General Battle Map System Stuff, mostly low level hardware stuff but also more

struct WeatherParticle {
    /* 00 */ short xPosition;
    /* 02 */ short yPosition;

    /* 04 */ short xSpeed;
    /* 06 */ short ySpeed;

    /* 08 */ u8  gfxIndex;
    /* 09 */ u8  typeId;
};

union WeatherEffectData {
    /**
     * Array of weather particles
     */
    struct WeatherParticle particles[0x40];

    /**
     * Buffer for cloud graphics
     */
    u32 gfxData[0xC0];
};

union GradientEffectData {
    /**
     * Buffer holding colors for vertical gradient.
     */
    u16 lines[320];

    /**
     * Buffer holding 8 different variations of the tileset palette
     * Variations have increasing amounts of red; used for flames weather effect
     */
    u16 fireGradient[8][0x40];
};

struct BMVSyncProc {
    PROC_HEADER;

    /* 2C */ const struct TileGfxAnim* tileGfxAnimStart;
    /* 30 */ const struct TileGfxAnim* tileGfxAnimCurrent;

    /* 34 */ short tileGfxAnimClock;
    /* 36 */ short tilePalAnimClock;

    /* 38 */ const struct TilePalAnim* tilePalAnimStart;
    /* 3C */ const struct TilePalAnim* tilePalAnimCurrent;
};

static void BMapVSync_UpdateMapImgAnimations(struct BMVSyncProc* proc);
static void BMapVSync_UpdateMapPalAnimations(struct BMVSyncProc* proc);
static void BMapVSync_InitMapAnimations(struct BMVSyncProc* proc);
static void BMapVSync_OnEnd(struct BMVSyncProc* proc);
static void BMapVSync_OnLoop(struct BMVSyncProc* proc);

static void WfxNone_Init(void);
static void WfxSnow_Init(void);
static void WfxSnow_VSync(void);
static void WfxRain_Init(void);
static void WfxRain_VSync(void);
static void WfxSandStorm_Init(void);
static void WfxSandStorm_VSync(void);
static void WfxSnowStorm_Init(void);
static void WfxSnowStorm_VSync(void);
static void WfxBlueHSync(void);
static void WfxBlue_Init(void);
static void WfxBlue_VSync(void);
static void WfxFlamesHSync(void);
static void WfxFlamesInitGradient(void);
static void WfxFlamesInitParticles(void);
static void WfxFlames_Init(void);
static void WfxFlamesUpdateGradient(void);
