#include "global.h"

#include "bmunit.h"
#include "player_interface.h"
#include "bmitem.h"
#include "fontgrp.h"
#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "statscreen.h"
#include "uiutils.h"
#include "bmcontainer.h"
#include "mu.h"
#include "icon.h"
#include "ctc.h"
#include "bmio.h"
#include "face.h"
#include "bm.h"
#include "scene.h"

#include "bmshop.h"

#include "constants/faces.h"
#include "constants/items.h"

struct BmShopProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ struct Unit* unit;
    /* 30 */ u16 shopItems[20];

    /* 58 */ u16 unk_58;

    /* 5A */ u8 shopItemCount;
    /* 5B */ u8 unitItemCount;
    /* 5C */ u8 curIndex;
    /* 5D */ u8 unk_5d;
    /* 5E */ u8 unk_5e;
    /* 5F */ u8 unk_5f; // maybe top visible item in menu?
    /* 60 */ u8 unk_60;
    /* 61 */ u8 shopType;
    /* 62 */ u8 helpTextActive;

    /* 64 */ s16 unk_64;
    /* 66 */ s16 unk_66;
    /* 68 */ s16 unk_68;
};

struct BmShop2Proc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x54-0x29];

    /* 54 */ struct BmShopProc* unk_54;
};

typedef void (*ShopFunc)(struct BmShopProc*, int);

struct ShopState {
    /* 00 */ u16 unk_00;
    /* 02 */ u16 unk_02;
    /* 04 */ u16 unk_04;
    /* 06 */ u16 unk_06;
    /* 08 */ u16 unk_08;
    /* 0A */ u16 unk_0A;
    /* 0C */ u16 unk_0C;
    /* 10 */ int unk_10;
    /* 14 */ ShopFunc unk_14;
    /* 18 */ ProcPtr unk_18;
};

u16 CONST_DATA gDefaultShopInventory[] = {
    ITEM_SWORD_IRON,
    ITEM_LANCE_IRON,
    ITEM_AXE_IRON,
    ITEM_BOW_IRON,
    ITEM_ANIMA_FIRE,
    ITEM_STAFF_HEAL,
    ITEM_NONE,
    ITEM_NONE,
};

int CONST_DATA gShopDialogueOffsetLut[] = {
    [SHOP_TYPE_ARMORY]      = 0,
    [SHOP_TYPE_VENDOR]      = 1,
    [SHOP_TYPE_SECRET_SHOP] = 2
};

int CONST_DATA gShopPortraitLut[] = {
    [SHOP_TYPE_ARMORY]      = FID_SHOP_ARMORY,
    [SHOP_TYPE_VENDOR]      = FID_SHOP_VENDOR,
    [SHOP_TYPE_SECRET_SHOP] = FID_SHOP_SECRET
};

struct ProcCmd CONST_DATA gProcScr_ShopFadeIn[] = {
    PROC_CALL(AddSkipThread2),
    PROC_SLEEP(1),

    PROC_CALL_ARG(sub_8014BD0, -1),
    PROC_CALL(StartFadeInBlackMedium),

    PROC_REPEAT(WaitForFade),
    PROC_CALL(BMapDispSuspend),

    PROC_END,
};

struct ProcCmd CONST_DATA gProcScr_ShopFadeOut[] = {
    PROC_CALL(ResetDialogueScreen),

    PROC_CALL(BMapDispResume),
    PROC_CALL(RefreshBMapGraphics),

