#include "global.h"

#include "bmunit.h"
#include "player_interface.h"
#include "bmitem.h"
#include "fontgrp.h"
#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "statscreen.h"
#include "uiutils.h"
#include "bmcontainer.h"
#include "mu.h"
#include "icon.h"
#include "ctc.h"

#include "constants/items.h"

struct BmShopProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ struct Unit* unk_2c;
    /* 30 */ u16 unk_30[0x14];

    /* 58 */ u16 unk_58;

    /* 5A */ u8 unk_5a;
    /* 5B */ u8 unk_5b;
    /* 5C */ u8 unk_5c;
    /* 5D */ u8 unk_5d;
    /* 5E */ u8 unk_5e;
    /* 5F */ u8 unk_5f;
    /* 60 */ u8 unk_60;
    /* 61 */ u8 unk_61;
    /* 62 */ u8 unk_62;
    /* 63 */ u8 unk_63;
    /* 64 */ s16 unk_64;
    /* 66 */ s16 unk_66;
    /* 68 */ s16 unk_68;
};

struct BmShop2Proc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x54-0x29];

    /* 54 */ struct BmShopProc* unk_54;
};

typedef void (*ShopFunc)(struct BmShopProc*, int);


extern int gUnknown_08A3918C[]; // portrait lut
extern int gUnknown_08A39180[]; // dialogue lut

extern u16 gUnknown_08A39170[]; // default inventory?

extern struct ProcCmd gUnknown_08A39210[];

extern struct ProcCmd gUnknown_08A394C0[];

extern struct TextHandle gUnknown_0203EF68[];
extern u16 gUnknown_02023CB6[]; // offset of BG2

extern struct ProcCmd gUnknown_08A39198[];

extern struct ProcCmd gUnknown_08A391D0[];

extern u8 gUnknown_089AD934[]; // tsa

extern u16 gUnknown_08B1754C[]; // pal
extern u8 gUnknown_08B12DB4[]; // gfx

extern u8 gUnknown_08A295D4[]; // tsa

extern u16 gUnknown_02022E5E[];

extern u16 gUnknown_089AD9F8[]; // pal

extern struct ProcCmd gUnknown_08A394C0[];

extern u16 gUnknown_02022E60[]; // offset of bg0

extern int gUnknown_0203EFB4;

extern struct ProcCmd gUnknown_08A39488[];

struct TextHandle gUnknown_03001DA0;

extern u16 gUnknown_02023CB6[]; // offset of bg

extern struct ProcCmd gUnknown_08A39478[];

extern u16 gUnknown_08A39498[]; // sprite

extern u8 gUnknown_08A1C704[]; // icon gfx?
extern u16 gUnknown_08A1A084[]; // pal

struct ShopState {
    /* 00 */ u16 unk_00;
    /* 02 */ u16 unk_02;
    /* 04 */ u16 unk_04;
    /* 06 */ u16 unk_06;
    /* 08 */ u16 unk_08;
    /* 0A */ u16 unk_0A;
    /* 0C */ u16 unk_0C;
    /* 10 */ int unk_10;
    /* 14 */ ShopFunc unk_14;
    /* 18 */ ProcPtr unk_18;
};

extern struct ShopState gUnknown_0203EF98;
extern struct ShopState* gUnknown_08A394D8;// = &gUnknown_0203EF98;


// forward declaration
void MakeShop(struct Unit*, u16*, u8, ProcPtr);
void sub_80B42B4(struct BmShopProc*);
void sub_80B4F04(struct BmShopProc*);
void sub_80B505C(struct BmShopProc*);
void sub_80B5164(struct TextHandle*, int, struct Unit*, u16*);
void sub_80B51C0(struct TextHandle*, int, struct Unit*, u16*);
void sub_80B55AC(u16, u16, u16, u16, int, ShopFunc, struct BmShopProc*);
void sub_80B5604(void);
int sub_80B5698(void);
u16 sub_80B568C(void);
u16 sub_80B56A8(void);
void sub_80B5384(void);
s8 sub_80B56CC(void);
u16 sub_80B5220(struct Unit*, int);
void sub_80B5440(struct BmShopProc*);
s8 sub_80B527C(int);
u16 sub_80B5268(int);
void sub_80B4ED4(u16*);
void sub_80B52CC(void);
void sub_80B53BC(int, int);
void sub_80B4E24(struct BmShopProc*);
void sub_80B4F90(struct BmShopProc*);
void sub_80B4E88(u16*);
void sub_80B53F8(int, int, u16, int);
