#include "global.h"

#include "hardware.h"
#include "proc.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "ctc.h"
#include "bmio.h"
#include "fontgrp.h"
#include "bmmap.h"
#include "chapterdata.h"

struct ChapterIntroFXProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unk_2C;
    /* 30 */ int unk_30;

    u8 _pad1[0x4C-0x34];

    /* 4C */ s16 unk_4C;
    /* 4E */ s16 unk_4E;
    /* 50 */ s16 unk_50;
    /* 52 */ u16 unk_52;

    u8 _pad2[0x64-0x54];

    /* 64 */ s16 unk_64;
    /* 66 */ s16 unk_66;
    /* 68 */ s16 unk_68;
};

// arm_call.s
void sub_80D74B0();

// code.s
void sub_80895B4(int, int);
int sub_808979C(struct RAMChapterData*);
void sub_808966C(int, int);
void sub_80896FC(u16*, int, int);

void sub_80ADDFC(int, int, int, int, int, int);
void sub_80ADE90(int, s16, s16);
void sub_80ADEE0(int, int, int, int, int);


extern u8 gUnknown_08B12DB4[];

extern u8 gUnknown_08B17B64[];
extern u8 gUnknown_08B18ED4[];
extern u8 gUnknown_08B18D68[];
extern u8 gUnknown_08B19874[];
extern u8 gUnknown_08B19DEC[];

extern u16 gUnknown_08B18F34[];
extern u16 gUnknown_08B19854[];
extern u16 gUnknown_08B196D8[];

extern u16 gUnknown_02022928[];

extern u16 gUnknown_02022968[];

void ChapterIntro_Bg3Scroll_Loop(void);

struct ProcCmd CONST_DATA sProcScr_ChapterIntro_Bg3Scroll[] = {
    PROC_REPEAT(ChapterIntro_Bg3Scroll_Loop),

    PROC_END,
};

void ChapterIntro_KeyListen_Init(struct ChapterIntroFXProc* proc);
void ChapterIntro_KeyListen_Loop(struct ChapterIntroFXProc* proc);

