#include "global.h"

#include "chapterdata.h"
#include "bmsave.h"
#include "hardware.h"
#include "face.h"
#include "bmreliance.h"
#include "soundwrapper.h"
#include "fontgrp.h"
#include "bmsave.h"
#include "ctc.h"

struct EndingTitleEnt {
    /* 00 */ u8 pid;
    /* 02 */ u16 titleTextId;
    /* 04 */ int unk_04;
};

struct EndingWithdrawalEnt {
    /* 00 */ u8 pid;
    /* 01 */ u8 retreatDesignation;
};

struct EndingPairingEnt {
    /* 00 */ u8 type; // 1 = Alone, 2 = with A Support
    /* 01 */ u8 pidA;
    /* 02 */ u8 pidB;
    /* 04 */ int textId;
};

struct EndingDetailsProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x2E - 0x29];
    /* 2E */ u16 unk_2e;
    /* 30 */ struct EndingPairingEnt* unk_30;
    /* 34 */ void* unk_34;
    /* 38 */ struct Unit* unitA;
    /* 3C */ struct Unit* unitB;
    /* 40 */ u32* unk_40;
};

struct EndingDetails8A3D420Proc {
    /* 00 */ PROC_HEADER;

    /* 2C */ struct Unit* units[2];
    /* 34 */ int unk_34;
    /* 38 */ struct EndingPairingEnt* unk_38;
    /* 3C */ u16 battleAmounts[2];
    /* 40 */ u16 winAmounts[2];
    /* 44 */ u16 lossAmounts[2];
};

struct EndingDetails8A3D478Proc {
    /* 00 */ PROC_HEADER;

    /* 2C */ struct EndingPairingEnt* unk_2c;
    /* 30 */ struct Unit* unitA;
    /* 34 */ struct Unit* unitB;
    /* 38 */ u32 unk_38;
    /* 3C */ int unk_3c;
    /* 40 */ int unk_40;
    /* 44 */ const char* unk_44;
    /* 48 */ struct TextHandle* textHandle;
};

struct Fin8A3D498Proc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x4c-0x29];
    /* 4C */ u16 unk_4c;
    /* 4E */ u8 _pad2[0x58-0x4e];
    /* 58 */ int unk_58;
};

struct EndingTurnRecordProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;
    /* 38 */ u8 unk_38;
    /* 39 */ u8 unk_39;
    /* 3A */ u8 _pad[0x4c-0x3a];
    /* 4C */ s16 unk_4c;
};

struct UnkProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x40-0x29];
    /* 40 */ u8 unk_40[12]; // size unknown
    /* 4C */ u16 unk_4c[5];
};

extern struct EndingTitleEnt gUnknown_08A3D1B0[];
extern struct EndingWithdrawalEnt gUnknown_08A3D2C0[];
extern struct EndingPairingEnt* gUnknown_08A3D1A8[];

extern char* gUnknown_08A3CD64;

extern u16* gUnknown_08A3D348[];

extern struct TextHandle* gUnknown_08A3D358;

extern u8 gUnknown_08A3D40C[];

extern struct TextHandle* gUnknown_08A3D674;

extern u8 gUnknown_08A3F750[]; // gfx
extern u8 gUnknown_08A3FFEC[]; // tsa
extern u8 gUnknown_08A40068[]; // tsa
extern u16 gUnknown_08A3F710[]; // pal
extern u16 gUnknown_08B1754C[]; // pal

extern u8 gUnknown_08A40204[]; // tsa
extern u8 gUnknown_08A400E4[]; // tsa

extern u8 gUnknown_08A40470[]; // tsa
extern u8 gUnknown_08A4034C[]; // tsa
extern u16 gUnknown_02022CAC[];

extern u16 gUnknown_08A09A5C[]; // pal
extern u8 gUnknown_085A647C[]; // tsa

extern u16 gUnknown_08A40AD4[]; // pal
extern u8 gUnknown_08A40B14[]; // tsa

// "Fin" image
extern u16 gUnknown_08A405B4[]; // pal
