#include "global.h"

#include "hardware.h"
#include "fontgrp.h"
#include "ctc.h"
#include "bmitem.h"
#include "statscreen.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "uiutils.h"
#include "face.h"
#include "scene.h"
#include "bmio.h"
#include "bmlib.h"

struct HelpBoxScrollProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ const char* unk_2c;
    /* 30 */ struct Font* unk_30;

    /* 34 */ struct TextHandle* unk_34[9]; // unknown size; 3?

    /* 58 */ int unk_58;
    /* 5C */ s16 unk_5c;
    /* 5E */ s16 unk_5e;
    /* 60 */ u16 unk_60;
    /* 62 */ s16 unk_62;
    /* 64 */ s16 unk_64;
};

struct HelpBox8A01650Proc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x58-0x29];

    /* 58 */ int unk_58;
    /* 5C */ int unk_5c;
    /* 60 */ int unk_60;
    /* 64 */ s16 unk_64;
};

struct HelpBox8A016E0Proc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;

    /* 38 */ u8 unk_38;

    /* 3C */ u16* unk_3c;
    /* 40 */ u8 unk_40;
};

struct HelpBox8A01760Proc {
    /* 00 */ PROC_HEADER;

    /* 2C */ const char* unk_2c;
    /* 30 */ struct Font* unk_30;
    /* 34 */ struct TextHandle* unk_34[5];

    /* 48 */ s16 unk_48;
    /* 4A */ s16 unk_4a;
    /* 4C */ s16 unk_4c;
    /* 4E */ s16 unk_4e;
    /* 50 */ u8 unk_50;
    /* 51 */ u8 unk_51;
    /* 52 */ u8 unk_52;
    /* 53 */ u8 unk_53;
    /* 54 */ u8 unk_54;
    /* 55 */ u8 unk_55;
    /* 56 */ u8 unk_56;
    /* 57 */ u8 unk_57;
    /* 58 */ u8 unk_58;
    /* 59 */ u8 unk_59;
};

struct HelpBox8A01800Proc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;

    /* 34 */ u8 _pad[0x5c-0x34];

    /* 5C */ int unk_5c;
};

struct Struct203E794 {
    /* 00 */ struct Font font;
    /* 16 */ struct TextHandle text[3];
    /* 30 */ u16 unk_30;
};

extern struct Struct203E794 gUnknown_0203E794;

// gfx
extern u8 gGfx_HelpTextBox[];
extern u8 gGfx_HelpTextBox2[];
extern u8 gGfx_HelpTextBox3[];
extern u8 gGfx_HelpTextBox4[];
extern u8 gGfx_HelpTextBox5[];

extern u16 gUnknown_0859EF40[]; // pal

extern struct HelpBoxInfo gUnknown_0203E7C8;
extern const struct HelpBoxInfo* gUnknown_0203E7E4;

extern struct ProcCmd gProcScr_HelpBoxTextScroll[];
extern struct ProcCmd gUnknown_08A01650[];
extern struct ProcCmd gUnknown_08A01678[];
extern struct ProcCmd gUnknown_08A01698[];
extern struct ProcCmd gUnknown_08A016C8[];
extern struct ProcCmd gProcScr_BoxDialogue[];
extern struct ProcCmd gUnknown_08A01740[];
extern struct ProcCmd gUnknown_08A01818[];

extern u16 gPal_YellowTextBox[];
extern u16 gPal_HelpTextBox[];

struct Struct0203E7E8 {
    /* 00 */ struct Font unk_00;
    /* 18 */ struct TextHandle unk_18[5];
    /* 40 */ u16 unk_40;
    /* 42 */ u16 unk_42;
};

extern struct Struct0203E7E8 gUnknown_0203E7E8;

extern u8 gGfx_YellowTextBox[];
extern u8 gGfx_YellowTextBox2[];
extern u8 gGfx_YellowTextBox3[];
extern u8 gGfx_YellowTextBox4[];
extern u8 gGfx_YellowTextBox5[];

// (probably) forward declarations

void sub_808A354(const struct HelpBoxInfo*);
void sub_808A384(struct HelpBoxProc*, int, int);
void sub_808A3C4(struct HelpBoxProc*, int, int);
void sub_808A43C(struct HelpBoxProc*, int, int);
void sub_808A444(struct HelpBoxProc*);
int sub_808A454(int);
void sub_808AC0C(int, int, int);
void sub_808A9F0(void);
void sub_808ACFC(int, int, int, int);
void sub_808BAA4(void);
void sub_808BA60(int, int, int);

//! FE8U = 0x08089804
void LoadHelpBoxGfx(void* vram, int palId) {

    if (vram == 0) {
        vram = (void *)0x06013000;
    }

    if (palId < 0) {
        palId = 5;
    }

    palId = (palId & 0xF) + 0x10;

    Decompress(gGfx_HelpTextBox, vram + 0x360);
    Decompress(gGfx_HelpTextBox2, vram + 0x760);
