#include "global.h"

#include "constants/terrains.h"

#include "bmmap.h"
#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "fontgrp.h"
#include "uiutils.h"

#include "minimap.h"

struct MinimapProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;
    /* 38 */ int unk_38;
    /* 3C */ int unk_3c;
    /* 40 */ int unk_40;

    /* 44 */ u8 _pad[0x4A - 0x44];

    /* 4A */ s16 unk_4a;
    /* 4C */ s16 unk_4c;
};

extern u8 gGfx_MinimapTiles[];
extern u16 gPal_MinimapTiles[];
extern u16 gPal_08A1FFD0[];

extern s16 gUnknown_02000280;

extern s16* gUnknown_02000500;
extern s16* gUnknown_02000504;
extern s16* gUnknown_02000508;

extern u16 (*gUnknown_0200050C)[8][16];

// hino.s
void sub_80131D0(s16*);
void sub_80131F0(s16*, int, int, int, int);


void ApplyMinimapGraphics(int);
void sub_80A86AC(struct MinimapProc*);

void Minimap_HandleOpen(ProcPtr proc);
void sub_80A8568(struct MinimapProc* proc);
void sub_80A7F1C(struct MinimapProc* proc);
void Minimap_LoopRotateIn(struct MinimapProc* proc);
void sub_80A8410(void);
void Minimap_Idle_InputHandler(ProcPtr proc);
void Minimap_HandleClose(struct MinimapProc* proc);
void Minimap_LoopRotateOut(struct MinimapProc* proc);
void Minimap_AdjustCursorOnClose(struct MinimapProc* proc);

struct ProcCmd CONST_DATA gProcScr_Minimap[] = {
    PROC_CALL(AddSkipThread2),

    PROC_SLEEP(0),

    PROC_CALL(ClearBg0Bg1),
