#include "global.h"

#include "proc.h"
#include "ap.h"
#include "items.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "hardware.h"

#include "mu.h"

/*
    "MOVEUNIT" proc and related functions.
    Handles managing and displaying moving map sprites.
*/

// TODO: move this elsewhere
// I can't move this to functions.h because signatures contain types that would be not defined
// So we'll have to wait for the corresponding files to be decompiled/get a header
void sub_8013928(const u16*, int, int, struct Proc* proc);
int GetSpellAssocFacing(Item item);

// TODO: move this elsewhere
// For some reason putting this in variables.h makes the ROM not match???????
// I must be missing something
extern const struct MMSData gUnknown_089A2E00[]; // Moving Map Sprite Table

struct MUStepSoundProc {
	PROC_HEADER;

	/* 29 */ u8 _pad29[0x58 - 0x29];

	/* 58 */ unsigned u58;
	/* 5C */ unsigned u5C;
	/* 60 */ unsigned u60;
	/* 64 */ short u64;
	/* 66 */ short u66;
};

struct MUEffectProc {
	PROC_HEADER;

	/* 29 */ u8 _pad29[0x54 - 0x29];
	/* 54 */ struct MUProc* pMUProc;

	/* 58 */ u8 _pad58[0x64 - 0x58];
	/* 64 */ short timeLeft;
	/* 66 */ short frameIndex;
};

struct MUFadeEffectProc {
	PROC_HEADER;

	/* 2C */ struct MUProc* pMUProc;
	/* 30 */ u8 u30;
};

struct MUProc* NewMOVEUNIT(u16 x, u16 y, u16 classIndex, int objTileId, unsigned palId);
struct MUConfig* GetNextMoveunitEntryStruct(int objTileId, u8* outIndex_maybe);
struct MUConfig* sub_807920C(int objTileId, u8* outIndex_maybe);
const void* MMS_GetROMTCS(u16 classId);
const void* GetMovingMapSpriteGfxPtrFromMOVEUNIT(struct MUProc* proc);
void* GetMOVEUNITGraphicsBuffer(int muIndex);
void MOVEUNIT6C_ChangeFutureMovement(struct MUProc* proc, const u8 commands[MU_COMMAND_MAX_COUNT]);
void __MOVEUNIT6C_PlaySoundStepByClass(struct MUProc* proc);
void MOVEUNIT6C_PlaySoundStepByClass(struct MUProc* proc);
void EndMoveunitMaybe(struct MUProc* proc);
void sub_80790CC(struct MUProc* proc);
void DisplayFogThingMaybe(int x, int y);
u16 MOVEUNIT6C_GetMovementSpeed(struct MUProc* proc);
u16 GetSomeAdjustedCameraX(int);
u16 GetSomeAdjustedCameraY(int);
u8 GetMOVEUNITDisplayPosition(struct MUProc* proc, struct PositionS16* out);
void UpdateMOVEUNITGfx_Idle(struct MUProc* proc);
void UpdateMOVEUNITGfx_Movement(struct MUProc* proc);
void Delete6C__(struct MUProc* proc);
void sub_8079A74(struct MUProc* proc, int flashType);
void TCS_HaltAnim2(int argAp);
void sub_807990C(int argAp);
void TCS_HaltAnim(int argAp);
void SetMOVEUNITField44To1(struct Proc* proc);

static void sub_8078C58(struct MUProc* proc);
static void nullsub_54(struct MUProc* proc);
static void MOVU_Call2_Moving(struct MUProc* proc);
static void MOVU_Call3_Wait(struct MUProc* proc);
static void MOVU_Call4_SetState2(struct MUProc* proc);
static void MOVU_Call5_WaitForSomething(struct MUProc* proc);

static void _6CMOVEUNIT_Destructor(struct MUProc* proc);
static void _6CMOVEUNIT_Loop(struct MUProc* proc);

static void BlendTimer6C_MainLoop(struct MUEffectProc* proc);

static void sub_8079654(struct MUEffectProc* proc); // MUBlink main

static void sub_8079730(struct MUEffectProc* proc);
static void sub_807988C(struct MUEffectProc* proc);

static void sub_80799A8(struct MUFadeEffectProc* proc);
static void sub_80799A0(struct MUFadeEffectProc* proc);
static void sub_80799C8(struct MUFadeEffectProc* proc);
static void sub_8079AD4(struct MUFadeEffectProc* proc);
static void sub_80799EC(struct MUFadeEffectProc* proc);
static void sub_8079A10(struct MUFadeEffectProc* proc);
static void sub_8079A50(struct MUFadeEffectProc* proc);

#define MU_GetDisplayXOrg(proc) ((((proc)->xSubPosition + (proc)->xSubOffset) >> MU_SUBPIXEL_PRECISION) + 8)
#define MU_GetDisplayYOrg(proc) ((((proc)->ySubPosition + (proc)->ySubOffset) >> MU_SUBPIXEL_PRECISION) + 8)

#define MU_AdvanceGetCommand(proc) (proc->pMUConfig->commands[proc->pMUConfig->currentCommand++])

// NON-CONST DATA

// Buffer for graphics
// I do not know how to handle this :/
extern u8 gUnknown_02004BE0[MU_GFX_MAX_SIZE * MU_MAX_COUNT];

static struct MUConfig sMUConfigArray[MU_MAX_COUNT];

// CONST DATA

#ifndef CONST_DATA
#   define CONST_DATA const __attribute__((section(".data")))
#endif // CONST_DATA

extern CONST_DATA u16* gUnknown_089A2920[];

extern CONST_DATA struct ProcCmd gUnknown_089A2938[]; // gProc_MUStepSound

extern CONST_DATA short gUnknown_089A2988[]; // gDirectionMoveOffsetLookup

extern CONST_DATA struct ProcCmd gUnknown_089A2968[];

extern CONST_DATA u16 gUnknown_089A2998[]; // feet sounds
extern CONST_DATA u16 gUnknown_089A29BC[]; // heavy sounds
extern CONST_DATA u16 gUnknown_089A2A00[]; // mounted sounds
extern CONST_DATA u16 gUnknown_089A2A2E[]; // wyvern sounds
extern CONST_DATA u16 gUnknown_089A2A5A[]; // pegasi sounds
extern CONST_DATA u16 gUnknown_089A2AB2[]; // zombie sounds
extern CONST_DATA u16 gUnknown_089A2AD4[]; // skelly sounds
extern CONST_DATA u16 gUnknown_089A2AF6[]; // mogall sounds
extern CONST_DATA u16 gUnknown_089A2B22[]; // spider sounds
extern CONST_DATA u16 gUnknown_089A2B3A[]; // dog sounds
extern CONST_DATA u16 gUnknown_089A2B68[]; // gorgon sounds
extern CONST_DATA u16 gUnknown_089A2BCE[]; // boat sounds
extern CONST_DATA u16 gUnknown_089A2C02[]; // myrrh sounds

// MU state handler function pointer lookup
static CONST_DATA MUStateHandlerFunc gUnknown_089A2C28[] = {
	sub_8078C58,
	nullsub_54,
	MOVU_Call2_Moving,
	MOVU_Call3_Wait,
	MOVU_Call4_SetState2,
	MOVU_Call5_WaitForSomething,
	nullsub_54,
	nullsub_54,
};

CONST_DATA struct ProcCmd gUnknown_089A2C48[] = {
	PROC_SET_NAME("MOVEUNIT"),
	PROC_SET_MARK(4),

	PROC_SET_DESTRUCTOR(_6CMOVEUNIT_Destructor),
	PROC_LOOP_ROUTINE(_6CMOVEUNIT_Loop)
};

// obj tile id offset by MU id
static CONST_DATA u16 gUnknown_089A2C68[MU_MAX_COUNT] = {
	0x0000, 0x0010, 0x0008, 0x0018
};

// obj tile id offset by MU id (variant?)
static CONST_DATA u16 gUnknown_089A2C70[MU_MAX_COUNT] = { 
	0x0000, 0x0008, 0x0004, 0x0010
};

// Base Movement Speed Lookup
static CONST_DATA u8 gUnknown_089A2C78[2] = {
	2, // fast class base movement speed
	1  // slow class base movement speed
};

// Buffer index by MU index lookup
static CONST_DATA u8 gUnknown_089A2C7A[MU_MAX_COUNT+1] = {
	0, // dummy entry (this array is 1-indexed)

	0, 2, 1, 3
};

// gProc_MUDeathFadeEffect
CONST_DATA struct ProcCmd gUnknown_089A2C80[] = {
	PROC_LOOP_ROUTINE(BlendTimer6C_MainLoop),
	PROC_SLEEP(15),

	PROC_END
};

// gProc_MUBlinkingEffect
CONST_DATA struct ProcCmd gUnknown_089A2C98[] = {
	PROC_LOOP_ROUTINE(sub_8079654),
	PROC_END
};

// Doesn't match without being volatile
// :/
static CONST_DATA vu8 gUnknown_089A2CA8[0x40] = {
	0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F,
	0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E, 0x1F,
	0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2A, 0x2B, 0x2C, 0x2D, 0x2E, 0x2F,
	0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F
};

static CONST_DATA struct ProcCmd gUnknown_089A2CE8[] = {
	PROC_LOOP_ROUTINE(sub_8079730),
	PROC_END
};

CONST_DATA struct ProcCmd gUnknown_089A2CF8[] = {
	PROC_SLEEP(8),
	PROC_CALL_ROUTINE(sub_807988C),

	PROC_END
};

static CONST_DATA struct ProcCmd gUnknown_089A2D10[] = {
	PROC_CALL_ROUTINE(sub_80799A0),
	PROC_SLEEP(1),

	PROC_CALL_ROUTINE(sub_80799A8),
	PROC_SLEEP(2),

	PROC_CALL_ROUTINE(sub_80799C8),
	PROC_SLEEP(3),

	PROC_CALL_ROUTINE(sub_80799A8),
	PROC_SLEEP(2),

	PROC_CALL_ROUTINE(sub_80799C8),
	PROC_SLEEP(3),

	PROC_CALL_ROUTINE(sub_80799A8),
	PROC_SLEEP(1),

	PROC_CALL_ROUTINE(sub_80799EC),
	PROC_LOOP_ROUTINE(sub_8079A10),

	PROC_SLEEP(17),
	PROC_CALL_ROUTINE(sub_8079A50),

	PROC_END
};

static CONST_DATA struct ProcCmd gUnknown_089A2D98[] = {
	PROC_SLEEP(17),
	PROC_CALL_ROUTINE(sub_8079AD4),
	PROC_END
};

void ResetMoveunitStructs(void) {
	int i;

	for (i = 0; i < MU_MAX_COUNT; ++i)
		sMUConfigArray[i].muIndex = 0;
}

struct MUProc* Make6CMOVEUNITForUnit(struct Unit* pUnit, unsigned classIndex, unsigned palId) {
	struct MUProc* proc = NewMOVEUNIT(
		pUnit->xPos,
		pUnit->yPos,

		classIndex,

		-1,
		palId
	);

	proc->pUnit = pUnit;
	proc->boolAttractCamera = TRUE;

	return proc;
}

struct MUProc* MakeMOVEUNITForMapUnit(struct Unit* pUnit) {
	struct MUProc* proc;

	unsigned classIndex = pUnit->pClassData->number;

	if (pUnit->state & US_IN_BALLISTA) {
		struct Trap* blst = GetTrap(pUnit->ballistaIndex);

		// FIXME: use class id definitions

		switch (blst->data[TRAP_EXTDATA_BLST_ITEMID]) {

		case Ballista:
			classIndex = 0x67;
			break;

		case IronBallista:
			classIndex = 0x68;
			break;

		case KillerBallista:
			classIndex = 0x69;
			break;

		} // switch (blst->data[TRAP_EXTDATA_BLST_ITEMID])
	}

	proc = NewMOVEUNIT(
		pUnit->xPos,
		pUnit->yPos,

		classIndex,

		-1,
		GetUnitMapSpritePaletteIndex(pUnit)
	);

	proc->pUnit = pUnit;
	proc->boolAttractCamera = TRUE;

	return proc;
}

void sub_80784D8(struct MUProc* proc) {
	_6CMOVEUNIT_Loop(proc);
}

void MOVEUNIT6C_SetCameraFollow(struct MUProc* proc) {
	proc->boolAttractCamera = TRUE;
}

void MOVEUNIT6C_UnsetCameraFollow(struct MUProc* proc) {
	proc->boolAttractCamera = FALSE;
}

struct MUProc* Make6CMOVEUNITForUI(struct Unit* pUnit, int x, int y) {
	struct MUProc* proc = MakeMOVEUNITForMapUnit(pUnit);

	if (!proc)
		return NULL;

	proc->xSubPosition = x << MU_SUBPIXEL_PRECISION;
	proc->ySubPosition = y << MU_SUBPIXEL_PRECISION;

	proc->stateId = MU_STATE_UI_DISPLAY;

	return proc;
}

void sub_8078524(struct MUProc* proc) {
	SMS_80266F0(
		GetClassStandingMapSpriteId(proc->displayedClassId),
		proc->muIndex
	);
}

struct MUProc* NewMOVEUNIT(u16 x, u16 y, u16 classIndex, int objTileId, unsigned palId) {
	struct MUConfig* config;
	struct MUProc* proc;
	struct APHandle* ap;

	unsigned otherThing = 0;
	u8 thing = 0;

	if (objTileId == -1)
		config = GetNextMoveunitEntryStruct(objTileId = MU_BASE_OBJ_TILE, &thing);
	else
		config = sub_807920C(objTileId, &thing);

	if (!config)
		return NULL;

	if (Proc_Find(gUnknown_089A2C48))
		otherThing = 0xFE;

	proc = (struct MUProc*) Proc_Create(gUnknown_089A2C48, ROOT_PROC_5);

	if (!proc)
		return NULL;

	proc->pUnit = NULL;
	proc->stateId = MU_STATE_IDLE_EXEC;

	proc->xSubPosition = (x * 16) << MU_SUBPIXEL_PRECISION;
	proc->ySubPosition = (y * 16) << MU_SUBPIXEL_PRECISION;

	proc->xSubOffset = 0;
	proc->ySubOffset = 0;

	proc->directionId_maybe = 11;

	proc->moveTimer = 0;
	proc->stepSoundTimer = otherThing;

	proc->displayedClassId = classIndex;
	proc->boolIsHidden = 0;

	proc->vramPtr_maybe = OBJ_VRAM0 + (0x20 * objTileId);

	proc->muIndex = thing;

	proc->objPriorityBits = 0x800;

	proc->moveSpeedConfig = 0;
	proc->boolForceMaxSpeed = FALSE;

	config->paletteIndex = palId;

	ap = AP_Create(MMS_GetROMTCS(classIndex), 10);
	AP_SwitchAnimation(ap, 4);

	CopyDataWithPossibleUncomp(
		GetMovingMapSpriteGfxPtrFromMOVEUNIT(proc),
		GetMOVEUNITGraphicsBuffer(config->muIndex)
	);

	ap->pGraphics = GetMOVEUNITGraphicsBuffer(config->muIndex);
	ap->tileBase = ((config->paletteIndex & 0xF) << 12) + config->objTileIndex + proc->objPriorityBits;

	proc->pAPHandle = ap;
	proc->pMUConfig = config;

	config->pMUProc = proc;

	return proc;
}

void MOVEUNIT6C_SetSpriteDirection(struct MUProc* proc, int directionId) {
	proc->directionId_maybe = directionId;

	if (directionId == 15)
		sub_8027068(proc->muIndex, proc->vramPtr_maybe);
	else
		AP_SwitchAnimation(proc->pAPHandle, proc->directionId_maybe);
}

void MOVEUNIT6C_SetDefaultSpriteDirection(struct MUProc* proc) {
	if (GetROMClassStruct(proc->displayedClassId)->attributes & CA_MOUNTEDAID)
		MOVEUNIT6C_SetSpriteDirection(proc, 1);
	else
		MOVEUNIT6C_SetSpriteDirection(proc, 2);
}

void _MOVEUNIT6C_SetDefaultFacingDirection(void) {
	struct MUProc* proc = (struct MUProc*) Proc_Find(gUnknown_089A2C48);

	if (proc)
		MOVEUNIT6C_SetDefaultSpriteDirection(proc);
}

void _MOVEUNIT6C_ChangeFutureMovement(const u8 commands[MU_COMMAND_MAX_COUNT]) {
	struct MUProc* proc = (struct MUProc*) Proc_Find(gUnknown_089A2C48);

	if (proc)
		MOVEUNIT6C_ChangeFutureMovement(proc, commands);
}

int DoesMoveunitExist(void) {
	return Proc_Find(gUnknown_089A2C48) ? TRUE : FALSE;
}

#if NONMATCHING

int IsThereAMovingMoveunit(void) {
	int i;

	for (i = 0; i < MU_MAX_COUNT; ++i)
		if ((sMUConfigArray[i].muIndex) && (sMUConfigArray[i].pMUProc->stateId != MU_STATE_IDLE_EXEC))
			return TRUE;

	return FALSE;
}

#else // NONMATCHING

__attribute__((naked))
int IsThereAMovingMoveunit(void) {
	asm(
		".syntax unified\n"

		"push {lr}\n"
		"movs r3, #0\n"
		"ldr r0, _08078764  @ sMUConfigArray\n"
		"adds r2, r0, #0\n"
		"adds r2, #0x48\n"
		"adds r1, r0, #0\n"
	"_08078744:\n"
		"ldrb r0, [r1]\n"
		"cmp r0, #0\n"
		"beq _08078754\n"
		"ldr r0, [r2]\n"
		"adds r0, #0x3f\n"
		"ldrb r0, [r0]\n"
		"cmp r0, #1\n"
		"bne _08078768\n"
	"_08078754:\n"
		"adds r2, #0x4c\n"
		"adds r1, #0x4c\n"
		"adds r3, #1\n"
		"cmp r3, #3\n"
		"ble _08078744\n"
		"movs r0, #0\n"
		"b _0807876A\n"
		".align 2, 0\n"
	"_08078764: .4byte sMUConfigArray\n"
	"_08078768:\n"
		"movs r0, #1\n"
	"_0807876A:\n"
		"pop {r1}\n"
		"bx r1\n"

		".syntax divided\n"
	);
}

#endif // NONMATCHING

int sub_8078770(struct MUProc* proc) {
	if (proc->pMUConfig->muIndex && proc->stateId != MU_STATE_IDLE_EXEC)
		return TRUE;

	return FALSE;
}

void MOVEUNIT6C_ChangeFutureMovement(struct MUProc* proc, const u8 commands[MU_COMMAND_MAX_COUNT]) {
	int i;

	for (i = 0; i < 0x40; ++i)
		proc->pMUConfig->commands[i] = commands[i];

	proc->pMUConfig->currentCommand = 0;
	proc->stateId = MU_STATE_MOVING_EXEC;

	__MOVEUNIT6C_PlaySoundStepByClass(proc);
}

struct MUProc* sub_80787C4(u16 x, u16 y, u16 classIndex, unsigned palId, const u8 commands[MU_COMMAND_MAX_COUNT]) {
	struct MUProc* proc = NewMOVEUNIT(x, y, classIndex, -1, palId);

	if (!proc)
		return NULL;

	MOVEUNIT6C_ChangeFutureMovement(proc, commands);
	return proc;
}

void Init6C_89A2938(struct MUStepSoundProc* proc) {
	proc->u58 = 0;
	proc->u64 = 0;

	proc->u5C = 0;
	proc->u66 = 0;
}

void Call89A2938_PlaySound1(struct MUStepSoundProc* proc) {
	PlaySpacialSoundMaybe(proc->u58, proc->u64);
}

void Call89A2938_PlaySound2(struct MUStepSoundProc* proc) {
	if (proc->u5C)
		PlaySpacialSoundMaybe(proc->u5C, proc->u66);
}

void NewSoundStepPlay6C(int soundId, int b, int hPosition) {
	struct MUStepSoundProc* proc;

	proc = (struct MUStepSoundProc*) Proc_Find(gUnknown_089A2938);

	if (!proc)
		proc = (struct MUStepSoundProc*) Proc_Create(gUnknown_089A2938, ROOT_PROC_3);

	if (!proc->u58) {
		proc->u58 = soundId;
		proc->u64 = hPosition;
	} else if (!proc->u60) { // TODO: FIXME: Is this a bug? u60 is never initialized
		proc->u5C = soundId + b;
		proc->u66 = hPosition;
	}
}

void __MOVEUNIT6C_PlaySoundStepByClass(struct MUProc* proc) {
	MOVEUNIT6C_PlaySoundStepByClass(proc);
}

void nullsub_19(struct MUProc* proc) {}

void Moveunit_ExecMoveCommand(struct MUProc* proc) {
	while (TRUE) {
		short command = MU_AdvanceGetCommand(proc);

		switch (command) {

		case MU_COMMAND_9:
			proc->moveTimer = MU_AdvanceGetCommand(proc);
			proc->stateId = MU_STATE_WAITING;

			return;

		case MU_COMMAND_10:
			nullsub_19(proc);

			proc->stateId = MU_STATE_WAITING_FOR_SOMETHING_TO_FINISH;

			DisplayFogThingMaybe(
				(proc->xSubPosition >> MU_SUBPIXEL_PRECISION) - gUnknown_0202BCB0.xCameraReal,
				(proc->ySubPosition >> MU_SUBPIXEL_PRECISION) - gUnknown_0202BCB0.yCameraReal
			);

			return;

		case MU_COMMAND_4:
			sub_80790CC(proc);

			return;

		case MU_COMMAND_FF:
			nullsub_19(proc);
			EndMoveunitMaybe(proc);

			return;

		case MU_COMMAND_0:
		case MU_COMMAND_1:
		case MU_COMMAND_2:
		case MU_COMMAND_3:
			command = command - MU_COMMAND_MOVE_BASE;

			if (command != proc->directionId_maybe) {
				MMS_GetROMTCS(proc->displayedClassId); // TODO: FIXME: is this a bug?
				MOVEUNIT6C_SetSpriteDirection(proc, command);

				proc->stateId = MU_STATE_MOVING_EXEC;
			}

			return;

		case MU_COMMAND_5:
		case MU_COMMAND_6:
		case MU_COMMAND_7:
		case MU_COMMAND_8:
			command = command - MU_COMMAND_TURN_BASE;

			if (command != proc->directionId_maybe) {
				MMS_GetROMTCS(proc->displayedClassId); // TODO: FIXME: is this a bug?
				MOVEUNIT6C_SetSpriteDirection(proc, command);
			}

			break;

		case MU_COMMAND_12:
			proc->moveSpeedConfig = MU_AdvanceGetCommand(proc);
			break;

		case MU_COMMAND_13:
			MOVEUNIT6C_SetCameraFollow(proc);
			break;

		case MU_COMMAND_14:
			MOVEUNIT6C_UnsetCameraFollow(proc);
			break;

		} // switch (command)
	} // while (TRUE)

	#undef MU_AdvanceGetCommand
}

struct SomeProc {
	PROC_HEADER;

	/* 2C */ int xDisplay;
	/* 30 */ int yDisplay;

	/* 34 */ u8 _pad34[0x50 - 0x34];

	/* 50 */ struct APHandle* pAPHandle;
	/* 54 */ u8 _pad54[0x64 - 0x54];
	/* 64 */ short u64;
};

void DisplayFogThingMaybe(int x, int y) {
	struct APHandle* ap;
	struct SomeProc* proc;

	CopyDataWithPossibleUncomp(
		gUnknown_089ADD4C,
		OBJ_VRAM0 + 0x20 * 0x180
	);

	ap = AP_Create(gUnknown_089A8EF8, 2);

	ap->tileBase = 0x1180;
	AP_SwitchAnimation(ap, 0);

	proc = (struct SomeProc*) Proc_Create(gUnknown_089A2968, ROOT_PROC_3);

	proc->pAPHandle = ap;

	proc->xDisplay = x + 8;
	proc->yDisplay = y - 4;
}

void Call6C_89A2968(struct SomeProc* proc) {
	PlaySoundEffect(0x77);

	proc->u64 = 0;

	// TODO: maybe a macro that takes angle/xScale/yScale?

	WriteOAMRotScaleData(
		0,  // oam rotscale index

		Div(+COS(0) * 16, 0x200), // pa
		Div(-SIN(0) * 16, 0x200), // pb
		Div(+SIN(0) * 16, 0x200), // pc
		Div(+COS(0) * 16, 0x200)  // pd
	);
}

void Loop6C_89A2968_1(struct SomeProc* proc) {
	int scale;

	if (proc->u64++ >= 8)
		Proc_ClearNativeCallback((struct Proc*) proc);

	scale = sub_8012DCC(5, 0x200, 0x100, proc->u64, 8);

	WriteOAMRotScaleData(
