#include "global.h"

#include "constants/items.h"
#include "constants/classes.h"

#include "proc.h"
#include "ap.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "hardware.h"
#include "bmio.h"
#include "bmunit.h"
#include "bmmap.h"
#include "bmtrick.h"
#include "bmbattle.h"
#include "mu.h"

/*
    "MOVEUNIT" proc and related functions.
    Handles managing and displaying moving map sprites.
*/

struct MUStepSoundProc {
    PROC_HEADER;

    /* 29 */ u8 _pad29[0x58 - 0x29];

    /* 58 */ unsigned idSound1;
    /* 5C */ unsigned idSound2;
    /* 60 */ unsigned u60_buggedmaybe; // Checked for in MU_StartStepSfx but never initialized
    /* 64 */ short xSound1;
    /* 66 */ short xSound2;
};

struct MUFogBumpFxProc {
    PROC_HEADER;

    /* 2C */ int xDisplay;
    /* 30 */ int yDisplay;

    /* 34 */ u8 _pad34[0x50 - 0x34];
    /* 50 */ struct APHandle* pAPHandle;

    /* 54 */ u8 _pad54[0x64 - 0x54];
    /* 64 */ short timer;
};

struct MUEffectProc {
    PROC_HEADER;

    /* 29 */ u8 _pad29[0x54 - 0x29];
    /* 54 */ struct MUProc* pMUProc;

    /* 58 */ u8 _pad58[0x64 - 0x58];
    /* 64 */ short timeLeft;
    /* 66 */ short frameIndex;
};

struct MUFlashEffectProc {
    PROC_HEADER;

    /* 2C */ struct MUProc* pMUProc;
    /* 30 */ u8 timer;
};

typedef void(*MUStateHandlerFunc)(struct MUProc*);

static struct MUProc* MU_CreateInternal(u16 x, u16 y, u16 classIndex, int objTileId, unsigned palId);

static void MU_StepSound_OnInit(struct MUStepSoundProc* proc);
static void MU_StepSound_OnFirstSound(struct MUStepSoundProc* proc);
static void MU_StepSound_OnSecondSound(struct MUStepSoundProc* proc);

static void MU_8078894(struct MUProc* proc);

static void MU_InterpretCommandScript(struct MUProc* proc);

static void MU_FogBumpFx_FirstFrame(struct MUFogBumpFxProc* proc);
static void MU_FogBumpFx_TransitionInLoop(struct MUFogBumpFxProc* proc);
static void MU_FogBumpFx_DisplayLoop(struct MUFogBumpFxProc* proc);

static void MU_State_WaitForFogBump(struct MUProc* proc);
static void MU_State_StartMovement(struct MUProc* proc);
static void MU_State_WaitForTimer(struct MUProc* proc);
static void MU_State_None(struct MUProc* proc);
static void MU_State_NoOp(struct MUProc* proc);
