#include "global.h"

#include <stdio.h>
#include <string.h>

#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "gamecontrol.h"
#include "ctc.h"
#include "fontgrp.h"
#include "bmunit.h"


struct ClassReelEnt {
    /* 00 */ u32 unk_00;

    /* 04 */ s8 unk_04;
    /* 05 */ u8 unk_05;
    /* 06 */ u8 unk_06;
    /* 07 */ u8 unk_07;
    /* 08 */ u8 unk_08;
    /* 09 */ u8 unk_09;
    /* 0A */ u8 unk_0A;
    /* 0B */ u8 unk_0B;
    /* 0C */ u8 unk_0C;
    /* 0D */ u8 unk_0D;
    /* 0E */ u8 unk_0E;

    /* 14 */ void* unk_14;
};

struct OpInfoProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 unk_29;
    /* 2A */ u8 unk_2a;
    /* 2B */ u8 unk_2b;
    /* 2C */ u8 unk_2c;
    /* 2D */ u8 unk_2d;
    /* 2E */ u8 unk_2e;
    /* 2F */ u8 unk_2f;
    /* 30 */ u16 unk_30;

    /* 32 */ s8 unk_32;
    /* 33 */ u8 unk_33;
    /* 34 */ u8 unk_34;

    /* 38 */ int unk_38;
    /* 3C */ int unk_3c;

    /* 40 */ u8 _pad[0x4C-0x40];

    /* 4C */ struct ClassReelEnt* unk_4c;
};

struct OpInfoEnterProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 unk_2a;
    /* 2C */ u16 unk_2c;
    /* 2E */ u8 unk_2e;

    /* 2F */ u8 _pad1[0x34-0x2F];

    /* 34 */ ProcPtr** unk_34;
    /* 38 */ ProcPtr unk_38;
    /* 3C */ ProcPtr unk_3c;
    /* 40 */ struct ClassReelEnt* unk_40;
};

struct OpInfoViewProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 unk_29;
    /* 2A */ u16 unk_2a;

    /* 2C */ u8 unk_2c;

    /* 2E */ s16 unk_2e;

    /* 30 */ s16 unk_30;
};

struct OpInfoIconProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 unk_2a;

    /* 2C */ u8 unk_2c;
    /* 2D */ u8 unk_2d;
    /* 2E */ u8 unk_2e;
};

struct OpInfo8A2F038Proc {
    PROC_HEADER;

    u8 _pad[0x4C-0x29];

    s16 unk_4c;
    s16 unk_4e;
};

struct OpInfo8A2F068Proc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x4C-0x29];

    /* 4C */ s16 unk_4c;

    /* 4E */ u8 _pad2[0x64-0x4E];

    /* 64 */ s16 unk_64;
    /* 66 */ s16 unk_66;
    /* 68 */ s16 unk_68;
};

struct OpInfoClassDisplayProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 unk_2a;
    /* 2C */ u16 unk_2c;

    /* 30 */ ProcPtr unk_30;
    /* 34 */ struct ClassReelEnt* unk_34;
    /* 38 */ void* unk_38;
    /* 3C */ ProcPtr unk_3c;
    /* 40 */ u8 unk_40[6];
    /* 46 */ u8 unk_46;
};

struct OpInfoGaugeDrawProc {
    PROC_HEADER;

    u16 unk_2a;
    u16 unk_2c;
    struct OpInfoClassDisplayProc* unk_30;
    u8 unk_34;
    u8 unk_35;
};

// TODO: Duplicated in branched_promotion.c
struct Struct_80B4108 {
    u16* a;
    s8 b;
    s8 c;
    s8 d;
};

// TODO: Move elsewhere

void sub_805A7B4(void*);
s8 sub_805A96C(void*);
void sub_805A990(void*);
void sub_805AA28(void*);
void sub_805AE14(void*);

// TODO: Forward declarations

void sub_80B40E4(ProcPtr, int);
struct ClassReelEnt* sub_80B40EC(int, int);
ProcPtr sub_80B2F3C(ProcPtr, struct ClassReelEnt*);
ProcPtr sub_80B3EDC(ProcPtr, struct ClassReelEnt*);
signed char* sub_80B369C(u8, signed char*);
ProcPtr sub_80B305C(ProcPtr, u8);
ProcPtr sub_80B325C(ProcPtr, u8);
struct Struct_80B4108* sub_80B4108(char);


extern struct ProcCmd gUnknown_08A20DA4[];
extern struct ProcCmd gUnknown_08A20DCC[];
extern struct ProcCmd gUnknown_08A2EEF0[];
extern u16 gUnknown_08A2EF48[];
