#include "global.h"

#include <stdio.h>
#include <string.h>

#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "gamecontrol.h"
#include "ctc.h"
#include "fontgrp.h"
#include "bmunit.h"
#include "scene.h"
#include "classdisplayfont.h"
#include "opinfo.h"
#include "anime.h"

#include "constants/classes.h"

enum ClassReelScrOpCode {
    CLASS_REEL_OP_0,
    CLASS_REEL_OP_1,
    CLASS_REEL_OP_2,
    CLASS_REEL_OP_3,
    CLASS_REEL_OP_4,
    CLASS_REEL_OP_5,
    CLASS_REEL_OP_6,
    CLASS_REEL_OP_7,
    CLASS_REEL_OP_8,
};

struct ClassReelAnimScr {
    u16 opCode : 8;
    u16 extra  : 8;
} __attribute__((packed));

struct ClassReelEnt {
    /* 00 */ u32 descTextId;

    /* 04 */ s8 paletteId;
    /* 05 */ u8 classId;
    /* 06 */ u8 unk_06;
    /* 07 */ u8 banimId;
    /* 08 */ u8 magicFx;
    /* 09 */ u8 unk_09;
    /* 0A */ u8 unk_0A;
    /* 0B */ u8 unk_0B;
    /* 0C */ u8 unk_0C;
    /* 0D */ u8 unk_0D;
    /* 0E */ u8 unk_0E;
    /* 0F */ u8 unk_0F;

    /* 10 */ struct ClassReelAnimScr* script;
};

struct OpInfoProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 unk_29;
    /* 2A */ u8 unk_2a;
    /* 2B */ u8 unk_2b;
    /* 2C */ u8 mode;
    /* 2D */ u8 unk_2d;
    /* 2E */ u8 unk_2e;
    /* 2F */ u8 unk_2f;
    /* 30 */ u16 unk_30;

    /* 32 */ s8 unk_32;
    /* 33 */ u8 classSet;
    /* 34 */ u8 index;

    /* 38 */ int unk_38;
    /* 3C */ int unk_3c;

    /* 40 */ u8 _pad[0x4C-0x40];

    /* 4C */ struct ClassReelEnt* classReelEnt;
};

struct OpInfoEnterProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 timer;
    /* 2C */ u16 unk_2c;
    /* 2E */ u8 classNameLength;

    /* 2F */ u8 _pad1[0x34-0x2F];

    /* 34 */ ProcPtr** letterProcsPtr;
    /* 38 */ ProcPtr iconProc;
    /* 3C */ ProcPtr parentProc;
    /* 40 */ struct ClassReelEnt* classReelEnt;
};

struct OpInfoViewProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 unk_29;
    /* 2A */ u16 timer;

    /* 2C */ u8 charIndex;

    /* 2E */ s16 unk_2e;

    /* 30 */ s16 unk_30;
};

struct OpInfoIconProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 timer;

    /* 2C */ u8 classId;
    /* 2D */ u8 numIcons;
    /* 2E */ u8 unk_2e;
};

struct OpInfoFlareProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x4C-0x29];

    /* 4C */ s16 unk_4c;
    /* 4E */ s16 unk_4e;
};

struct OpInfoBurstProc {
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 _pad[0x4C-0x29];

    /* 4C */ s16 unk_4c;

    /* 4E */ u8 _pad2[0x64-0x4E];

    /* 64 */ s16 unk_64;
    /* 66 */ s16 unk_66;
    /* 68 */ s16 unk_68;
};

struct OpInfoClassDisplayProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 unk_2a;
    /* 2C */ u16 unk_2c;

    /* 30 */ ProcPtr unk_30;
    /* 34 */ struct ClassReelEnt* classReelEnt;
    /* 38 */ struct ClassReelAnimScr* script;
    /* 3C */ ProcPtr unk_3c;
    /* 40 */ u8 unk_40[6];
    /* 46 */ u8 unk_46;
};

struct OpInfoGaugeDrawProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ u16 unk_2a;
    /* 2C */ u16 unk_2c;
    /* 30 */ struct OpInfoClassDisplayProc* unk_30;
    /* 34 */ u8 unk_34;
    /* 35 */ u8 unk_35;
};

// TODO: Move elsewhere

void sub_805A7B4(void*);
s8 sub_805A96C(void*);
void sub_805A990(void*);
void sub_805AA28(void*);
void sub_805AE14(void*);

// TODO: Forward declarations

void sub_80B40E4(ProcPtr, int);
struct ClassReelEnt* GetClassReelEntry(int, int);
ProcPtr StartClassNameIntro(ProcPtr, struct ClassReelEnt*);
ProcPtr StartClassAnimDisplay(ProcPtr, struct ClassReelEnt*);
signed char* sub_80B369C(u8, signed char*);
ProcPtr StartClassNameIntroLetter(ProcPtr, u8);
ProcPtr StartClassNameIntroIcon(ProcPtr, u8);

extern struct ProcCmd CONST_DATA gProcScr_opinfo[];

extern ProcPtr* gUnknown_03001D50;

extern u16 gUnknown_08A30978[]; // tsa

extern u16 gUnknown_02022E68[];

static inline int DarknessCoeff(int darkness, u8 lsr) {
    return 0x10 - (darkness >> (lsr));
}

void ClassReel_Init(struct OpInfoProc* proc) {

    gLCDControlBuffer.dispcnt.mode = 0;

    SetupBackgrounds(0);

    NewEfxAnimeDrvProc();

    sub_806E8F0();

    proc->unk_38 = 0;
