#include "global.h"

#include "bmunit.h"
#include "bmitemuse.h"
#include "hardware.h"
#include "bmlib.h"
#include "ctc.h"
#include "face.h"
#include "icon.h"
#include "bmudisp.h"
#include "fontgrp.h"
#include "bm.h"
#include "uiutils.h"
#include "statscreen.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "bmshop.h"
#include "bmitem.h"
#include "bmitemuse.h"
#include "bmcontainer.h"

#include "prepscreen.h"

struct PrepItemScreenProc {
    /* 00 */ PROC_HEADER;
    /* 29 */ u8 unk_29 : 1;
    /* 2A */ u8 unk_2a;
    /* 2B */ u8 unk_2b;
    /* 2C */ s8 unk_2c;
    /* 2D */ u8 unk_2d;
    /* 2E */ u8 unk_2e;
    /* 2F */ u8 unk_2f;
    /* 30 */ u8 unk_30;
    /* 31 */ u8 unk_31;
    /* 32 */ s8 unk_32;
    /* 34 */ u16 unk_34;
    /* 36 */ u16 unk_36;
    /* 38 */ u16 unk_38[2];
    /* 3C */ u16 unk_3c[2];
    /* 40 */ u16 unk_40[2];
    /* 44 */ struct Unit* unk_44[2];
};

struct ProcA18944 {
    /* 00 */ PROC_HEADER;
    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;
    /* 38 */ int unk_38;
};

struct ProcA1898C {
    /* 00 */ PROC_HEADER;
    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;
};

// TODO: Are these all part of the same array of TextHandles?
extern struct TextHandle gUnknown_02013510[];
extern struct TextHandle gUnknown_02013538[];
extern struct TextHandle gUnknown_02013560[];
extern struct TextHandle gUnknown_02013570[];
extern struct TextHandle gUnknown_02013588[];

extern u8 Img_PrepTextShadow[];
extern u8 Img_PrepPopupWindow[];

extern u8 gUnknown_08A1B1FC[]; // gfx
extern u16 gUnknown_08A1B638[]; // pal

extern u8 gUnknown_08A1B8B8[]; // tsa
extern u8 gUnknown_08A1B990[]; // tsa


int CheckInLinkArena(void);

// Forward declarations

s8 sub_8098E40(struct PrepItemScreenProc*);
void sub_8098FAC(struct PrepItemScreenProc*);
void sub_8099E98(int, struct Unit*, u16, u16, u16);
void sub_8099F7C(struct TextHandle*, u16*, struct Unit*, u16);
void sub_809A08C(struct PrepItemScreenProc*);
void sub_809A114(struct PrepItemScreenProc*, u8, s8);
s8 sub_809A21C(u32, int);
void sub_809A274(struct PrepItemScreenProc*);
