
#include "global.h"

#include "proc.h"
#include "ctc.h"
#include "hardware.h"
#include "fontgrp.h"
#include "bmio.h"
#include "bm.h"
#include "event.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "face.h"
#include "bmunit.h"
#include "uiutils.h"

struct SceneState
{
    /* 00 */ const char* nextChar;
    /* 04 */ const char* unk04;
    /* 08 */ u8 defaultColor;
    /* 09 */ u8 unkLine09;
    /* 0A */ u8 unkLine0A;
    /* 0B */ u8 unkLine0B;
    /* 0C */ u8 unk0C;
    /* 0D */ u8 unk0D;
    /* 0E */ u8 unkWidth0E;
    /* 0F */ s8 speakingFaceSlot;
    /* 10 */ u8 unkFaceSlot10;
    /* 11 */ u8 selectedFaceSlot;
    /* 12 */ s8 instantScroll;
    /* 13 */ s8 charDisplayDelay;
    /* 14 */ s8 charDisplayClock;
    /* 15 */ u8 unk15;
    /* 16 */ u8 unk16;
    /* 17 */ u8 unk17;
    /* 18 */ struct FaceProc* faces[8];
    /* 38 */ void(*unk38)(ProcPtr proc);
    /* 3C */ u32 userNumber;
    /* 40 */ char userNumberString[0x20];
    /* 60 */ char userString[0x20];
    /* 80 */ u16 config;
    /* 82 */ u8 unk82;
    /* 83 */ u8 unk83;
};

struct UnkDialogueProc {
    /* 00 */ PROC_HEADER;

    u8 _pad[0x58-0x29];
    int unk_58;
    int unk_5c;
    u8 _pad2[0x64-0x60];
    s16 unk_64;
    s16 unk_66;
    s16 unk_68;
    s16 unk_6a;
};

struct BlockingTimerProc {
    PROC_HEADER;

    u8 pad[0x64-0x29];
    s16 unk_64;
    s16 unk_66;
    s16 unk_68;
};

struct TalkDebugProc {
    PROC_HEADER;

    u8 pad[0x4c-0x29];
    int unk_4c;
    int unk_50;
    int unk_54;
    int unk_58;
    int unk_5c;
    int unk_60;
    s16 unk_64;
};

struct ChoiceEntryInfo
{
    /* 00 */ u16 msgid;
    /* 04 */ void(*onSwitchIn)(void);
};

struct TalkChoiceProc {
    /* 00 */ PROC_HEADER;

    /* 2A */ s16 selectedChoice;
    /* 2C */ s16 xDisp;
    /* 2E */ s16 yDisp;
    /* 30 */ int pad;
    /* 34 */ const struct ChoiceEntryInfo* choices;
};

// various bits of the box opening animation
extern u8 CONST_DATA gUnknown_089E8484[];
extern u8 CONST_DATA gUnknown_089E8434[];
extern u8 CONST_DATA gUnknown_089E83E0[];
extern u8 CONST_DATA gUnknown_089E8384[];
extern u8 CONST_DATA gUnknown_089E82E0[];
extern u8 CONST_DATA gUnknown_089E8238[];

// funcs
void sub_8006B4C(ProcPtr);
void sub_8007C0C(void);
void sub_8006C00(void);
void sub_8006C34(ProcPtr);
void sub_8007AB0(struct UnkDialogueProc*);
void sub_8007B0C(struct UnkDialogueProc*);
void _Loop6CBlockingTimer(struct BlockingTimerProc*);
void sub_8007C4C(struct BlockingTimerProc*);
void sub_8007D38(struct Proc*);
void sub_8007DA4(struct Proc*);
void sub_80B42E8(void);
void sub_80B4308(void);
void sub_8007E9C(struct TalkChoiceProc*);
void sub_8007F9C(struct Proc*);
void sub_8007FDC(struct Proc*);
void sub_80080D0(ProcPtr);
void sub_8008108(void);
void sub_80083F8(struct Proc*);
void sub_8008B30(void);
