#include "global.h"

#include "bmunit.h"
#include "bmudisp.h"
#include "mu.h"
#include "bmmap.h"
#include "chapterdata.h"
#include "bmtrick.h"
#include "bmlib.h"
#include "fontgrp.h"
#include "hardware.h"
#include "bm.h"
#include "bmio.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "bmitem.h"
#include "icon.h"
#include "uimenu.h"
#include "bksel.h"
#include "bmbattle.h"
#include "uiutils.h"
#include "bmmind.h"
#include "popup.h"
#include "cp_common.h"
#include "cp_perform.h"
#include "ctc.h"

#include "sio_core.h"
#include "sio.h"

#include "constants/terrains.h"

struct SioBattleMapProc
{
    /* 00 */ PROC_HEADER;
    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;
    /* 38 */ int unk_38;
    /* 3C */ STRUCT_PAD(0x3C, 0x58);
    /* 58 */ int unk_58;
};

struct SioProc85AA1AC
{
    /* 00 */ PROC_HEADER;
    /* 29 */ STRUCT_PAD(0x29, 0x64);
    /* 64 */ s16 unk_64;
};

extern u8 gUnknown_03001818[];
extern struct Vec2 gUnknown_0300182C;
extern int gUnknown_03001830;
extern u8 gUnknown_03001834[];
extern struct MUProc * gUnknown_03001838[];
extern u16 gUnknown_03001840[];

extern u8 gUnknown_080D9F28[][4];
extern struct Vec2 gUnknown_080D9F48[];

//! FE8U = 0x08049298
void sub_8049298(struct Unit * unit)
{
    int i;

    for (i = 0; i < UNIT_ITEM_COUNT; i++)
    {
        gUnknown_03001840[i] = unit->items[i];
    }

    return;
}

//! FE8U = 0x080492B8
void sub_80492B8(struct Unit * unit)
{
    int i;

    for (i = 0; i < UNIT_ITEM_COUNT; i++)
    {
        unit->items[i] = gUnknown_03001840[i];
    }

    return;
}

//! FE8U = 0x080492D8
void sub_80492D8(void)
{
    sub_8049594();
    RefreshUnitSprites();
    return;
}

//! FE8U = 0x080492E8
void sub_80492E8(int faction)
{
    int current = faction;
    int next = FACTION_ID_BLUE;

    while (1)
    {
        switch (current)
        {
