
#include "global.h"

#include <stdlib.h>

#include "proc.h"
#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "ctc.h"
#include "icon.h"
#include "fontgrp.h"
#include "bmio.h"
#include "bmitem.h"
#include "bmunit.h"
#include "bmbattle.h"
#include "bmreliance.h"
#include "uiutils.h"
#include "mu.h"

#include "constants/classes.h"

#include "statscreen.h"

struct StatScreenEffectProc
{
    /* 00 */ PROC_HEADER;

    /* 29 */ u8 pad29[0x38 - 0x29];

    /* 38 */ int direction;
    /* 3C */ int yDispInit;
    /* 40 */ int yDispFinal;

    /* 44 */ u8 pad44[0x4A - 0x44];

    /* 4A */ short newItem; // page or unit depending on slide
    /* 4C */ short timer;
    /* 4E */ short blendDirection;

    /* 50 */ u8 pad50[0x52 - 0x50];

    /* 52 */ u16   key;
};

struct StatScreenPageNameProc
{
    /* 00 */ PROC_HEADER;

    // Page Num Sprite Control proc only
    /* 2A */ short xLeftCursor;
    /* 2C */ short xRightCursor;
    /* 2E */ u16 animTimerLeft;
    /* 30 */ u16 animTimerRight;
    /* 32 */ short animSpeedLeft;
    /* 34 */ short animSpeedRight;

    // Page Name Sprite Control proc only
    /* 36 */ u8 pageNum;
    /* 38 */ short yScale; // 6 == times 1
};

struct StatScreenInfo
{
    /* 00 */ u8  unk00;
    /* 01 */ u8  unitId;
    /* 02 */ u16 config;
};

struct SSTextDispInfo
{
    /* 00 */ struct TextHandle* text;
    /* 04 */ u16* tilemap;
    /* 08 */ u8 color;
    /* 09 */ u8 xoff;
    /* 0C */ const unsigned* mid;
};

struct HelpPromptSprProc
{
    PROC_HEADER;

    /* 2C */ int xDisplay;
    /* 30 */ int yDisplay;
    /* 34 */ int tileref;
};

static void InitTexts(void);
static void DisplayTexts(const struct SSTextDispInfo* unk);
static void DisplayLeftPanel(void);
static void DisplayBwl(void);
static void DrawStatWithBar(int num, int x, int y, int base, int total, int max);
static void DisplayPage0(void);
static void DisplayPage1(void);
static void DisplaySupportList(void);
static void DisplayWeaponExp(int num, int x, int y, int wtype);
static void DisplayPage2(void);
static void DisplayPage(int pageid);
static struct Unit* FindNextUnit(struct Unit* u, int direction);
static void PageSlide_OnLoop(struct StatScreenEffectProc* proc);
static void PageSlide_OnEnd(struct StatScreenEffectProc* proc);
static void StartPageSlide(u16 config, int newPage, struct Proc* parent);
static void GlowBlendCtrl_OnInit(struct StatScreenEffectProc* proc);
static void GlowBlendCtrl_OnLoop(struct StatScreenEffectProc* proc);
static void StartGlowBlendCtrl(void);
