
#include "global.h"

#include <stdlib.h>
#include <string.h> // TODO: remove

#include "proc.h"
#include "hardware.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "ctc.h"
#include "icon.h"
#include "fontgrp.h"
#include "bmio.h"
#include "bmitem.h"
#include "bmunit.h"
#include "bmbattle.h"
#include "bmreliance.h"
#include "uiutils.h"
#include "mu.h"

#include "constants/classes.h"

#include "statscreen.h"

struct StatScreenInfo
{
    /* 00 */ u8  unk00;
    /* 01 */ u8  unitId;
    /* 02 */ u16 config;
};

struct SSTextDispInfo
{
    /* 00 */ struct TextHandle* text;
    /* 04 */ u16* tilemap;
    /* 08 */ u8 color;
    /* 09 */ u8 xoff;
    /* 0C */ const unsigned* mid;
};

// TODO: figure out what to do with those
// (It's in the weird EWRAM overlay area)

extern struct StatScreenSt gStatScreen; // statscreen state
extern u16 gBmFrameTmap0[0x280]; // bg0 tilemap buffer for stat screen page
extern u16 gBmFrameTmap1[0x240]; // bg2 tilemap buffer for stat screen page

static struct StatScreenInfo EWRAM_DATA sStatScreenInfo = {};

static struct HelpBoxInfo EWRAM_DATA sMutableHbi = {};
static const struct HelpBoxInfo* EWRAM_DATA sLastHbi = NULL;
static struct Vec2 EWRAM_DATA sHbOrigin = {};

static
struct SSTextDispInfo const sPage0TextInfo[] =
{
    { gStatScreen.text + STATSCREEN_TEXT_SKLLABEL,   gBmFrameTmap0 + TILEMAP_INDEX(1, 3),  TEXT_COLOR_GOLD, 0, &gUnknown_08A0116C },
    { gStatScreen.text + STATSCREEN_TEXT_SPDLABEL,   gBmFrameTmap0 + TILEMAP_INDEX(1, 5),  TEXT_COLOR_GOLD, 0, &gUnknown_08A01170 },
