#include "global.h"

#include "bmunit.h"
#include "bmreliance.h"
#include "bmsave.h"
#include "fontgrp.h"
#include "hardware.h"
#include "bmudisp.h"
#include "ctc.h"
#include "face.h"
#include "icon.h"
#include "uiutils.h"
#include "bm.h"
#include "statscreen.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "event.h"
#include "bmsave.h"

struct SupportScreenUnit {
    /* 00 */ u8 charId;
    /* 01 */ u8 classId;
    /* 02 */ u8 supportLevel[UNIT_SUPPORT_MAX_COUNT];
    /* 09 */ u8 partnerClassId[UNIT_SUPPORT_MAX_COUNT];
    /* 10 */ s8 partnerIsAlive[UNIT_SUPPORT_MAX_COUNT];
};

struct SupportScreenProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unk_2c;
    /* 30 */ int unk_30;
    /* 34 */ int unk_34;
    /* 38 */ int curIndex;
    /* 3C */ int unk_3c;
    /* 40 */ s8 unk_40; // possibly direction (up or down)
    /* 41 */ u8 unk_41; // possibly number of positions to move up or down
    /* 42 */ s8 fromPrepScreen; // true if from prep screen; false if from title screen
    /* 43 */ s8 helpTextActive;
};

struct SubScreenProc {
    /* 00 */ PROC_HEADER;

    /* 2C */ int unitIdx;
    /* 30 */ int x;
    /* 34 */ int y;
    /* 38 */ s8 fromPrepScreen;
    /* 39 */ u8 unk_39;
    /* 3A */ u8 unk_3a;
    /* 3B */ u8 unk_3b;
    /* 3C */ u8 partnerCount;
    /* 3D */ u8 remainingSupports;
    /* 3E */ u8 unk_3e;
    /* 3F */ u8 partnerState[UNIT_SUPPORT_MAX_COUNT];
    /* 46 */ u8 supportLevel[UNIT_SUPPORT_MAX_COUNT];
    /* 4D */ u8 partnerClassId[UNIT_SUPPORT_MAX_COUNT];
};

struct SupportScreenUnit* CONST_DATA sSupportScreenUnits = (void*)gStringBufferAlt;

u16 CONST_DATA gSprite_SupportScreenSuccessBox[] = {
    6,
    0x4004, 0x8000, 0x0000,
    0x4004, 0x8020, 0x0004,
    0x4004, 0x8040, 0x0008,
    0x4014, 0x4000, 0x000C,
    0x4014, 0x4020, 0x0010,
    0x4014, 0x4040, 0x0014,
};

u16 CONST_DATA gSprite_SupportScreenBanner[] = {
    3,
    0x4000, 0xC000, 0x0000,
    0x0000, 0x8040, 0x0008,
    0x8000, 0x8060, 0x000C,
};

extern u8 gUnknown_08A1DB80[];

extern u8 gGfx_SupportScreenBanner[];
extern u16 gPal_SupportScreenBanner[];
extern u8 gTsa_SupportSubScreen[];

int GetSupportScreenCharIdAt(int);
void sub_80A199C(struct SupportScreenProc*, int);
int GetSupportScreenPartnerCount(int);
void StartSupportUnitSubScreen(s8, int, ProcPtr);

extern struct TextHandle gUnknown_02013498[];
extern struct TextHandle gUnknown_02013590[];

extern int sSupportScreenUnitCount;
